[
    {
        "company_name": "air company",
        "job_position": "IOT Engineer",
        "job_description": " To handle wide range of IoT devices, including of sensors, RFID hardware, embedded controllers, data transmission modules, etc.;  \n To assist in application development on next -generation IoT devices;\n To be responsible for software and firmware coding, system  design and testing;\n To participate in demonstration, trial run, and commissioning with Project Team;\n To conduct hardware status inspecting, testing, repairing for deployed devices;\n To support Engineering Manager in system deployment related activities such as on -site installation, maintenance, ad -hoc troubleshooting",
        "email": "companyair67@gmail.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the IOT Engineer at air company. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to air company. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Algogene Financial Technology Company Limited",
        "job_position": "Quant Researcher",
        "job_description": "• Apply data analysis, modeling, machine learning, to design and develop realtime algorithmic trading models\n• Build, enhance and support research and trading tools\n• Assist in research and backtest on new trading strategies\n\nJob Requirements:\n\n• Good Mathematical knowledge (eg. Probability, Optimization, Multivariate Time Series, Stochastic Calculus, etc)\n• Strong programming skills (eg. Python, C++, OO, distributed/ concurrent architect, etc)\n• Preferred relevant experience in data management with good knowledge in one or more data technology (eg. NoSQL, Spark, Flink, Kafka, Hadoop, Tensorflow, etc)\n• Good knowledge in financial product, market and trade life cycle (eg. FX, Equities, Futures, Options, etc)\n• Preferred hand -on data modelling and machine lea rning experience (eg. ANN, MDP, NLP, etc) Strong passion in Startup environment",
        "email": "tonylam@algogene.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Quant Researcher at Algogene Financial Technology Company Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Algogene Financial Technology Company Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Artbat Live Limited",
        "job_position": "Junior Developer - AI, Data Science, Machine Learning",
        "job_description": "• Develop and maintain machine learning models  for analyzing and \nrecommending creative talent.\n• Collaborate with data scientists to preprocess and analyze large datasets.\n• Implement and optimize AI algorithms for better performance and accuracy.\n• Assist in the integration of AI models into the platform’s backend.\n• Conduct research on the latest AI and machine learning techniques to improve \nexisting solutions \n• Participate in code reviews and contribute to the development of best practices.\n• Debug and troubleshoot technical issues related to AI func tionalities \n• Write and execute unit tests to ensure code quality.\n• Stay updated with the latest advancements in AI, machine learning, and data \nscience.\n\nJob Requirements:\n\n• Bachelor’s Degree in Computer Science, Data Science, AI, or related field.\n• Strong kno wledge of Python and relevant libraries (e.g., TensorFlow, \nPyTorch).\n• Familiarity with data preprocessing, feature engineering, and model evaluation \ntechniques.\n•  Experience with SQL and NoSQL databases.\n•  Understanding of machine learning concepts and algori thms.\n•  Ability to learn quickly and adapt to new technologies.\n•  Excellent communication and documentation skills.\n•  Collaborative and team -oriented approach.",
        "email": "mike@artbatlive.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Junior Developer - AI, Data Science, Machine Learning at Artbat Live Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Artbat Live Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Canpanion Group Limited",
        "job_position": "Professional Technology Intern",
        "job_description": "We specialize in child development and have an exciting project that involves the development of an innovative AI application and game for our platform.  Our goal is to create an engaging and interactive digital experience  that enhances  children's learning and promotes their overall development.  \nWe are committed to building a team with diverse backgrounds, perspectives, and  skills.  \nWork closely with our CEO, COO and CTOs to develop the platform\nWork on Game development and  related design when needed\nEngage in UI/ UX design of the platform\nFlexibility to work on both software development, AI training, Machine Learning and any tech related tasks\nAssist in the development and implementation of software applications, websites, or other tech -related projects.\nCollaborate with team members to design, code, test, and debug software applications.\nConduct research and stay updated on the latest industry trends and technologies.\nProvide technical support and troubleshooting assistanc e to users.\nAssist in documenting software development processes and procedures.\nParticipate in team meetings and contribute innovative ideas and solutions.\nLearn and utilize various programming languages, tools, and frameworks.\nJob Requirements:  To be su ccessful in this role, you should meet the following job requirements:  \nProgramming knowledge: Familiarity with programming languages such as Java, C++, or Unity, and the ability to apply basic coding principles to develop simple applications or prototypes.\nCreativity and design thinking: An interest in creating visually appealing and user -friendly interfaces, with a basic understanding of user experience concepts.\nProblem -solving skills: The ability to tackle small -scale development challenges and work towa rds project milestones, with guidance from senior team members.\nEagerness to learn: A passion for technology and a willingness to expand your skills through hands-on experience and mentorship.\n Time management and organization: Some experience in managing your own tasks and meeting deadlines, though you may require support in prioritizing and planning your work.",
        "email": "admin@canpaniongroup.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Professional Technology Intern at Canpanion Group Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Canpanion Group Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "CastleGate Logistics Hong Kong Limited",
        "job_position": "Operation Analyst Intern",
        "job_description": "Job Description : \nResponsibilities:\n•Using the operational data to measure the performance of different vendors\nto identify area of improvements\n•Identify the gap in supplier experience and redesign the process.\n•Identify new business opportunities, or gap in existing operations\n•Compare our service offering against other digital freight forwarders and\ntraditional logistics companies\n•Identify the g ap in our system logic to further enhance the resources\nutilization\n•Optimize the shipment strategy under different business requirements\n•Communicate with CFS / Ocean agents / internal teams to ensure\nfollow?through on replenishment orders and inventory c ommitments and to\nenable best real time decisions\n•Work on different datasets to enable operations to monitor the business\nperformance\n•Support tech roadmap building and tool development (incl. defining\nproduct requirement, logic build, user acceptance tes t) to drive\nimprovements in the end -to-end logistics systems, data, and processes ;\nincluding light modeling to validate hypotheses, de -risk engineering,data\nscience investments and require to do a high volume of data analysis.\n•Drive root cause analysis/r eporting on operational issues, developing action\nplans and project managing improvements\n•Conduct process mapping to identify the improvement opportunities and\nexecute change management to implement\n•Conduct research, quantitative analyses and build busin ess models and\nprioritization matrices to drive decisions and development of value -added\nservice (e.g. supplier product performance analysis; origin milk -run\noptimization)\n•Align teams (Operations, Ocean, CFS etc.) to ensure strong execution and\nto underst and and manage the drivers that impact operational execution\n\nJob Requirements : \nQualifications: \n• University Student in Bachelor’s degree in Engineering, Information \nSystem, Business, Mathematics  or a Supply Chain/Operations discipline \n• Experience with Microsoft Office, and proficiency with SQL (or a system \nof equal complexity) / Python  \n• Strong quantitative experience, with the ability to conduct statistical \nanalysis, generate insights and solutions  or build a story and strategy from \nlarge data sets.  \n• Strong written and verbal communication skills, with the ability to lead \ndiscussions and communicate effectively  \n• Quick learner with an analytical approach to solving problems as part of a \nteam who has go od communication skills.  \n• Ability to work with people in a cross -functional environment  \n• Proficient in spoken and written English and Chinese; Cantonese & \nPutonghua  ",
        "email": "jobsasia@wayfair.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Operation Analyst Intern at CastleGate Logistics Hong Kong Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to CastleGate Logistics Hong Kong Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "ESG and Green Finance Limited",
        "job_position": "STEAM Teacher Assistant",
        "job_description": "Provide assistance to STEAM teachers with:  \n\t Drafting tutorial notes and teaching materials in the area of AI, \nBlockchain, Cloud, Data, ESG and Robotics.  \n\t Prepare materials for STEAM workshops and STEM Kits for students (Micro:bit, \nArduino, etc).  \n\nJob Requirement:  \n\t Experience in teaching kids  \n\t Knowledge of STEAM applications and programming in Micro:bit, \nArduino and Python.  \n\t Passion and will to learn. ",
        "email": "training@esgtraining.org",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the STEAM Teacher Assistant at ESG and Green Finance Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to ESG and Green Finance Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Five Stones Group Limited",
        "job_position": "Internship, Digital Advertising & Data Analytics Associate",
        "job_description": "(Position 2)  Position 2:Internship, Digital Advertising & Data Analytics Associate  \n\nJob Description : \n Fall into designated trainee stream on data driven digital marketing stream  \n Receive training and enhance on your digital marketing and data analytics \nskills  \n Learn fast with practices by get your hands dirty and apply knowledge from \njust-in-time trainings  \n Manage our online acqu isition channels including SEM, Facebook, \nInstagram, Display Networks  \n Work cross -functionally with the team to deliver for our customers  \n Perform ad performance analysis and business growth reporting with Google \nAnalytics  \n Assist in eDM and content marketing  development  \n Drive marketing campaigns for lead generation and user growth  \n Take full responsibility for marketing investment and expected return  \n Perform A/B testing for various channels and analyze campaign results  \n Generate new growth ideas for better performance and impact  \n Provide marketing advice for our users and key accounts to grow their \nbusiness  \n Assist with localised marketing development for cross -border marketing \nactivities  \n Speak at educational workshops and seminars to deliver marketing \nknowled ge \n Conduct user research to further enhance marketing features for our product  \n\nJob Requirements :  \n Degree holder is a must Students in Year 3 or Final Year preferred  \n Strong willingness to learn, fast learner and self driven  \n Self-reflective and open to feedba ck to make changes  \n Highly adaptive in fast moving and changing environment  \n Able to stay highly focused and pay attention to details  \n Fully responsible for results with strong growth mindset  \n High discipline and demand for personal quality  \n Great team player w ith good communication skills  \n Good command of Chinese and English is a must  \n Good Knowledge in e -commerce or digital marketing industry is a plus  ",
        "email": "talents@vimos.io",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Internship, Digital Advertising & Data Analytics Associate at Five Stones Group Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Five Stones Group Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Global Technology Integrator Limited",
        "job_position": "Assistant Business Analyst (STEM Internship)",
        "job_description": "• Join a rapidly expanding team to deliver Best -of-Breed professional services to enterprise/public sector accounts  \n• Elicit requirements using interviews, document analysis, requirements workshops, surveys, business process descriptions, use cases, scenarios , and task and workflow analysis  \n• To write professional comprehensive documentation, such as requirement specifications, functional specifications, implementation plans, test plans, user manual, etc.  \n• To work with the Project Manager to support end -to-end application implementation services and project delivery  \n• Monitors project progress by tracking activity; resolving problems; publishing progress reports; recommending actions.  \n\nJobs Requirements: \n• Degree holder in Information Technology, Computer Science  or equivalent  \ndisciplines \n• Solid experience in WCMS  \n• Strong business sense and good business writing skills",
        "email": "jobs@gti.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Assistant Business Analyst (STEM Internship) at Global Technology Integrator Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Global Technology Integrator Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "HAIXINDA TRADE CO., LIMITED",
        "job_position": "Data Analysis",
        "job_description": "Job Description:\n Around 0 -3 years of experience in Insurance/Financial Services Industry, with a focus on business analysis and/or system analysis.\n Proven track record in specifying user requirements and managing User\n Acceptance Testing Strong interpersonal skills Strong analytical and problem \nselling skil ls Excellent verbal and written communication skill Proficiency in \nVBA is an advantage\n Degree qualified, preferably in Business, Mathematics, Statistics, IT, \nOperations Management or related disciplines.\n\nJob Requirements:\n Provide business analysis service and/or process review to support business \ninitiatives/product implementation/project execution and/or operations \nproduction system related issues\n Collect, analyse and document business needs and requirements in Business\n Requirement Specification Review IT  documents to ensure alignment of \nunderstanding of requirements between business end users and IT\n Conduct feasibility study and/or gap analysis Evaluate solution in terms of \ncost, timeline and quality (fit -for purpose)\n Execute user acceptance testing inclu ding test planning, test case \npreparation/creation and execution\n Prepare training materials and conduct training to end users\n Conduct business/deployment verification test (BVT/DVT) and \nimplementation verification test (IVT)\n Provide post implementation sup port to end user immediately after system \nenhancement",
        "email": "haixinda.trade.co.limited@gmail.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Analysis at HAIXINDA TRADE CO., LIMITED. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to HAIXINDA TRADE CO., LIMITED. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "K. C. NG & Company",
        "job_position": "Summer Audit Trainee",
        "job_description": " Assist audit senior to perform audit of private limited in Hong Kong by using audit software as Caseware Auidt working paper as well as Microsoft office etc \n\nJob Description :\n assist in analyzing client financial data by using Excel (such as PivotTable) before importing into CaseWare Working Papers software;\n assist in importing the financial data into the CaseWa re Working Paper software;\n assist in performing analytical review procedures by using computer assisted software;\n assist in identifying and assess risk of material misstatement (inherent risk and control risk) after performing analyti cal review procedures;\n assist in calculation of materiality level and calculation of sample size of individual audit area, and assist in sorting out the required sample for substantive tests of the transactions;\n assist in doing any oth er ad hoc information or analytical review on financial data by using computer, such as ageing of trade receivable, trade payable and other seasonal trend of the sale, etc.;\n assist in computing the client's audited financial data before tagging i nto IRD e-filing standard templates;\n assist in importing and tagging audited financial data by using IRD iXBRL Data Preparation Tools before e-filing of tax return to IRD; and\n assist in upload the required forms and supporting documents through IRD e-tax services.\n\nJob Requirement:\n Good computer skill with analytical mind.\n hardworking and good accounting knowledge.",
        "email": "tn@kcngcpa.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Summer Audit Trainee at K. C. NG & Company. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to K. C. NG & Company. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Mark Technology Limited",
        "job_position": "Software Engineer",
        "job_description": "• Main focus on the development of the frontend and UX/UI. Involvement in large -scale project development. \n\nJob Requirements:  \n• Familiarity with a range of programming to ols and databases, including Microsoft .NET, Oracle, SQL Server, HTML/XML, Java, VB, C#, C++, \nJavaScript  \n• Knowledgeable in mobile app development is a definite advantage. ",
        "email": "jacky@clozeupp.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Software Engineer at Mark Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Mark Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Max Lucky Limited",
        "job_position": "Business Analyst",
        "job_description": "• Candidates are required to assist in conducting market analyses, analysing both product lines and the overall profitability of the business.\n• They are required to develop and monitor data quality metrics and ensure business data and reporting needs are met.\n• Strong technolo gy, analytical and communication skills are must-have traits.\n\nJob Requirements:\nFirst Year and above students.We welcome all disciplines to apply.\n\nInternship Period:  Summer Term 2024\nFull-time placements with a duration of no less than 4 consecutive weeks (28 calendar days)",
        "email": "career@maxlucky.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Business Analyst at Max Lucky Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Max Lucky Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "AlgoOne",
        "job_position": "Crypto Quantitative Analyst",
        "job_description": "Job Description:\n\n• Collect data via APIs\nBacktest & optimize trading strategies with Python\n• Analyze strategy results such as sharpe ratio, calmar ratio and annualized return\nwith Python\n• Visualize results with Matplotlib\n\nJob Requirements:\n\n• Python Python libraries such as Pandas, Numpy, Seaborn, Matplotlib etc\n• Statistics such as z -score, standard deviation, percentile, regression, correlation\nColab / Jupyter Notebook Bonus : cloud server, database, github etc",
        "email": "jason@algoone.io",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Crypto Quantitative Analyst at AlgoOne. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to AlgoOne. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "MOTION EXPERT HONG KONG LIMITED",
        "job_position": "Junior Research Assistant",
        "job_description": "• The candidate is expected to work with senior software engineers with respect to Information & Technology field; \n• The candidate is expected to work on basic coding works;\n• The candidate is expected to work all other  assigned  works.\n\nJob Requirements:\n\n• The candidate is expected to speak fluent English and Chinese (Pu Tong Hua or Cantonese)\n• Undergraduate and graduate students are welcomed with different backgrounds, software engineering, computer science, engineering background could  be an asset.",
        "email": "jikicheng@hkbu.edu.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Junior Research Assistant at MOTION EXPERT HONG KONG LIMITED. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to MOTION EXPERT HONG KONG LIMITED. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "OMNIA TECHNOLOGIES LIMITED",
        "job_position": "Robotics Engineer",
        "job_description": "As a Robotics Engineer, you will be responsible for enhancing the online capabilities of our UR3E collaborative robot (cobot), designing and 3D printing custom attachments to expand its functionality, and programming a simulation robot platform to test and demonstrate various robotic features. Your primary focus will be to leverage cutting -edge robotics technologies and simulation tools to drive innovation and optimize our automation processes. Key Responsibilities: UR3E Cobot Online Integration and Connectivity: Analyze the current capabilities of the UR3E cobot and identify opportunities to e nhance its online control, programming, and monitoring capabilities. Join Universal Robots cloud -based integration solution that enables remote access, real -time control, and seamless data exchange. Ensure secure and reliable communication between the UR3E  cobot and the cloud -based platform. Develop user -friendly interfaces and dashboards for remote operation and performance monitoring of the cobot. Custom Attachment Design and 3D Printing: Collaborate with cross -functional teams to identify the specific ne eds and requirements for custom cobot attachments. Design and model 3D CAD files for the desired attachments, considering factors such as compatibility, functionality, and ergonomics. Utilize advanced 3D printing technologies, such as FDM and SLA, to fabri cate the custom attachments. Test and validate the attachments to ensure they meet performance and safety standards. Robotics Simulation Platform Development: Research and select an appropriate simulation platform (e.g., ROS, Gazebo, V -REP) that aligns wit h our requirements and technical infrastructure. Program the simulation platform to accurately model the behavior and features of the UR3E cobot and its custom attachments. Develop realistic simulation scenarios that replicate our production workflows and test various robotic capabilities, such as path planning, object manipulation, and collision avoidance. Integrate the simulation platform with our existing systems and data sources to enable seamless data exchange and process optimization. Training and Kno wledge Sharing: Develop comprehensive training materials and conduct workshops to educate the team on the enhanced capabilities of the UR3E cobot, the custom attachments, and the simulation platform. Share insights and learnings with the broader robotics a nd automation community to contribute to the advancement of the field.",
        "email": "michele.bovetti@omnia-technologies.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Robotics Engineer at OMNIA TECHNOLOGIES LIMITED. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to OMNIA TECHNOLOGIES LIMITED. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Pacific century premium developments limited",
        "job_position": "A.I. Technology Researcher Intern",
        "job_description": "Job Description : \n\tEvaluate A.I. features on different software products.\n\tConduct usability testing and gather feedback.\n\tCreate educational materials for A.I. adoption.\n\tCollaborate with stakeholders to integrate A.I. into existing workflows\nJob Requirements :\n\tBackground in A.I., Machine Learning, or related fields (e.g., Computer\nScience, Data Science) Familiarity with A.I. frameworks and tools.\n\tGood analysis and problem -solving skills.\n\tAbility to communicate complex concepts effectively.",
        "email": "recruitment@pcpd.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the A.I. Technology Researcher Intern at Pacific century premium developments limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Pacific century premium developments limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Pivot Biomedical Engineering Limited",
        "job_position": "Engineering Intern",
        "job_description": "Duties We offer internships in different streams, including but not limited to AI, biomedical engineering, computer engineering, and mechanical engineering.\nBelow is a brief description of the main duties of each stream.\n• Artificial Intelligence/ Machine Learning/ Data Science/ Mathematics: \nPerform data mining, data cleansing, and data processing. Build, train, and \noptimize machine learning models.  \n• Create machine learning algorithms.\nBiotechnology/ Biomedical Science: \nAssist in biomedical research, includi ng analyzing recent academic papers and \npotential automated applications to solve clinical, industrial or laboratory \nneeds.\n•  Biomedical Engineering: Assist in medical device research to target clinical \nneeds. Work closely with talents in various discipline s to develop integrated \nbiomedical products as a team \n• Computer Science/ Computer Engineering/ Software Engineering: Assist in \nweb development (using XHTML, CSS and JavaScript), software development \n(Python -based preferred), and programming for automation m achines.\n• Electrical Engineering/ Electronic Engineering: Assist in printed circuit board \n(PCB) design, integrating sensors or electronic components into an integrated \nsystem. Code in C++ to control the embedded system.\n• Mechanical Engineering: Design machi ne architectures for the automation of \nmedical devices.\n• Assist in material science research, robotic control simulations, and building \nprotocols for automated medical devices.  \nJob Requirements:  \n• Bachelor’s Degree in any related disciplines of the above st reams \n• Enthusiastic in the applied field  \n• Well -organized, diligent and dutiful  \n• Able to read and write in English  \n• Able to communicate in Cantonese or Mandarin would be a plus",
        "email": "alex.cheng@pivotbme.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Engineering Intern at Pivot Biomedical Engineering Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Pivot Biomedical Engineering Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Pons Company Limited",
        "job_position": "AI Creative Engineer",
        "job_description": "Key Responsibilities In this role, you will:\n\n Run experiments to train, fine -tune and prompt engineer genAI diffusion \nmodels\n Rapidly iterate with clients’ needs to build something that they love\n Help create, optimise and deploy proprietary genAI pipelines\n Work cross -functionally across AI, product and go -to-market functions\nBenefits & Perks\n\n Be part of the rapid growth: hands on experience growing with an \ninternationally recognised genAI CreaTech s tartup\n True startup exposure: across AI, product and go -to-market business \nfunctions\n No-ego builder culture: collaborative, hard -working and idea meritocratic \nculture\n Global team: very smart builders with first -principles thinking from around \nthe world\n Others: remote work, flexible hours and meritocracy -based compensation, \n etc. possible \nAbout PONS.ai [PONS.ai](http://pons.ai/) is a generative AI startup offering \nhyper -personalized phygital products. For a full description, please see:\nhttps://www.linkedin.com/in/kelvtang/\n\nTo Apply Submit CV to support@pons.ai \n\nJob Requirements:\nRequirements To succeed in this role, you:\n Are a creative, hard -working and independent faster learner passionate \nabout using genAI to delight people\n Are always updated on the latest developments of genAI, read AI -related \nresearch papers, and comfortable diving into documentations\n Have experience w ith Python or a different object oriented language\n Have experience training / fine -tuning / prompt engineer diffusion models \nvia coursework / internship / personal projects\n Are familiar with git version control - Have / are studying towards a \nminimum bachelor's degree in Computer Science, Engineering, or a related \nfield\n Want to develop a career in genAI for creative / artistic use cases\n (Optional) Have experience working in marketing / design / advertising\n (Optional) Have experience with Microsoft Azur e and/or other cloud \nplatforms\n (Optional) Have experience with managing Python environments (e.g. \nconda / pip)",
        "email": "support@pons.ai",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI Creative Engineer at Pons Company Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Pons Company Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "QUANTier Limited",
        "job_position": "Technology Research Analyst Intern",
        "job_description": "QUANTier is seeking a highly motivated and talented  Technology Research  Analyst  Intern  to join our team. You will play a pivotal role in leveraging advanced technological tools and methodologies to conduct  market research,  competitor analysis, and contribute to the development of  product strategies  and a  dynamic  product roadmap. This internship offers a unique opportunity to gain a hands  on experience and insight in the field of  Quantum Technology.   \n\n• Conduct comprehensive market research and competitor analysis to identify market needs, trends, and opportunities in the field of Quantum Software  industry.     \n• Collaborate with the leadership team, including the product owner and the  development team, to contribute to the development of quantum software  product strategies and a product roadmap.   \n• Assist  in defining target market segments, customer personas, and value  propositions based on research findings.   \n• Collect and analyze data from various sources to provide insights and  recommendations for product enhancements and new product development.   \n• Create research reports, presentations, leaflets, and excel sheets to effectively communicate research findings, product strategies, and roadmap plans.   \n• Stay up -to-date with quantum industry trends and newly  emerging  technologies.  \n\nJob Requirements:   \n\n• Responsibility   \n• Energetic   \n• Communicative (for discuss and solve the task) Knowledge and Skill  \n• Meet the criteria in JD ",
        "email": "contact@quantier.io",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Technology Research Analyst Intern at QUANTier Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to QUANTier Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "R-Digital Limited",
        "job_position": "Digital Marketing Assistant/ Brand Creator",
        "job_description": "We are seeking a motivated and creative Digital Marketing Assistant intern to support our marketing team.In this role, you will gain hands-on experience in various aspects of digital marketing, including social media management, content creation, email marketing, SEO, and analytics. Responsibilities:  Assist with managing and growing our social media channels (F acebook, Instagram, LinkedIn, etc.)  Create engaging and visually appealing social media posts, graphics, and other content -Develop and schedule email marketing campaigns  Conduct keyword research and implement basic SEO tactics to improve website visibility  Monitor and analyze digital marketing campaign performance using tools like Google Analytics  Assist with other digital marketing projects and tasks as needed  Assist with a project with 'Women Entrepreneurs Hong Kong' Job Requirements:  Currently enrolled in a bachelor's or master's degree program  Strong written and verbal communication skills  Love using social media platforms for business purposes  Ability to work independently and as part of a team  Passion for digital marketing and a desire to learn  Creative mindset and enjoy brainstorming new ideas",
        "email": "carman@rdigital.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Digital Marketing Assistant/ Brand Creator at R-Digital Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to R-Digital Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "SilkyWater Asset Management Limited",
        "job_position": "檔案管理",
        "job_description": "• 將我們現時公司的線上檔案，例如：雲端上的資料進行整合. \n\nJob Requirements: \n  • 熟悉電腦的運作，需要細心和耐性.",
        "email": "info@silky-water.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the 檔案管理 at SilkyWater Asset Management Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to SilkyWater Asset Management Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Visual Earth Limited",
        "job_position": "Position 2:Software & AI Development Intern",
        "job_description": "Visual Earth Limited is an innovative startup dedicated to revolutionizing pet care\n through advanced AI and smart technology. Our flagship product, the TechPup\n HugVest, provides emotional support and real -time monitoring to ensure dogs are\n always happy and  healthy.\n\nIn this internship, you will help with:\n\n Developing App for interface with hardware.\n Uploading data into the cloud from microprocessors.\n Reading data from the cloud and showing it on the phone.\n Using AI tools for classification and prediction.\n\nJob Requirements:\n Programming skills (preferably Python or C)\n Software & app development skills\n Basic knowledge of working with microprocessors\n Basic Figma or any other app designing skills",
        "email": "Tayseer@ideabeeDesign.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Position 2:Software & AI Development Intern at Visual Earth Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Visual Earth Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Welldify Limited",
        "job_position": "Software Engineer Intern",
        "job_description": "Welldify is seeking  enthusiastic and talented Software Engineer Interns to join our  technical team. As an intern, you will work closely with our CTO and engineers to develop, test, and maintain software solutions that meet the needs of our users. This is a fantastic opportunity to gain hands -on experience in a fast -paced startup environment  and contribute to meaningful projects.  \n• Collaborate with the technical team: Assist in the design, development, and  testing of software applications.  \n• Write clean, maintainable code: Follow  best practices to ensure code quality  and readability.  \n• Debug and troubleshoot: Identify and fix bugs and performance issues in  existing codebases.  \n• Participate in code reviews: Provide and receive constructive feedback to improve code quality.  \n• Learn and  grow: Take advantage of mentorship and learning opportunities to  enhance your skills and knowledge. \nJob Requirements: \n• Currently pursuing a degree: In Computer Science, Software Engineering, or a related field.  \n• Programming skills: Proficiency  in one or more programming languages such  as Python, Java, JavaScript, or C++.  \n• Knowledge in React Native is a plus.  \n• Problem -solving mindset: Ability to approach complex problems with a logical  and analytical mindset.  \n• Team player: Strong communication s kills and the ability to work effectively in  a team environment.  \n• Passion for technology: Eagerness to learn new technologies and continuously  improve your skills.  \n• Knowledge of web development: Understanding of HTML, CSS, and  JavaScript frameworks.  \n• Expos ure to software development methodologies: Experience with Agile or  Scrum practices.  \n• Personal projects or contributions: Any relevant personal projects or  contributions to open -source software.",
        "email": "team@welldify.io",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Software Engineer Intern at Welldify Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Welldify Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "YouthIncubatorLimited",
        "job_position": "WebsiteDesignerIntern",
        "job_description": "JobDescription:\nWebsiteDevelopment:\nEngageinbothfront-endandback-endwebsitedevelopmenttasks, workingwiththemotivatedandself-driventeam.\nUtiliseyourskillsinUI/UXdesignusing\nFigmatocreatevisuallyappealinganduser-friendlyinterfaces.\nImplementthedesignedinterfacesusingWebflow,ano-codeplatform,to bringthedesignstolife.\nCollaboratewiththeengineeringteamtodevelopbackendalgorithmsin\nPythontopowertheplatform'sfunctionality.\nNetworking(Optional):\nParticipateincross-functionalteammeetingswithexternalpartieslike\nFamilyOffices,Foundations,EventOrganisers.\nJobRequirements:\nDemonstrateastronggrowthmindsetandawillingnesstolearnandadapt\nin a fast-paced,dynamicenvironment.\nWewelcomecandidatesfromallmajorsandeducationalbackgrounds.\nWorkingIndependentlyovertheWFHarrangementPreferably,Full-Stack DevelopmentKnowledge:Familiaritywithfront-endandback-end\ndevelopmentaswellasPython.",
        "email": "calvin@youthincu.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the WebsiteDesignerIntern at YouthIncubatorLimited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to YouthIncubatorLimited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Latote Technology Limited",
        "job_position": "AI Development Intern",
        "job_description": "• Assist in the development and implementation of AI models and algorithms.  \n• Collaborate with the AI team to design, prototype, and test machine learning \nsolutions.  \n• Conduct research on state -of-the-art AI techniques and contribute to the \nimprovement of existing models.  \n• Participate in code reviews, debugging, and optimization of AI -related projects.  \n• Help in the preparation of technical docum entation and presentations.  \n\nJob Requirements:  \n• Currently pursuing or recently completed a Bachelor's degree in Computer \nScience, Data Science, Artificial Intelligence, or a related field. • Basic \nunderstanding of machine learning concepts and algorithms.  \n• Familiarity with programming languages such as Python and libraries like \nTensorFlow, PyTorch, or scikit -learn.  \n• Strong analytical skills and a keen interest in AI technologies.  \n• Ability to work well in a team and communicate effectively.  \n• Eager to learn and a pply new AI techniques and tools.",
        "email": "info@latote.io",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI Development Intern at Latote Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Latote Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    }
]