[
    {
        "company_name": "Hong Kong Inclusion Platform Limited",
        "job_position": "Business Development and HR analyst Internship",
        "job_description": "Using advanced job searching software to analyze potential target companies/ candidates Helping develop reports and analyses of potential customer Identify, analyze, and interpret HK market hiring trends  Processing confidential data and information according to guidelines.  Managing master data, including creation, updates, and deletion.  Managing users and user roles in HKIP Platform    Provide quality assurance of imported data, working with quality assurance analysts if necessary.  Generating HK Hiring reports from single or multiple systems.  Troubleshooting the reporting database environment and reports.",
        "email": "calvin@the-hkip.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Business Development and HR analyst Internship at Hong Kong Inclusion Platform Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Hong Kong Inclusion Platform Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "BrainChamp Limited",
        "job_position": "Games Development & Data Analytics Intern",
        "job_description": "This will be a structured internship program which gives interns a step -by-step  guidance and learning journey on games development and data analytics. Interns will  get the opportunity to design and develop competitive games with Unity, receive  feedback fro m neuropsychologist professor, interact with game players, and complete  games which will be launched on this engaging platform. Meanwhile, interns will get  the opportunity to co -publish an academic paper together with our neuropsychologist  professor on the  relationship between BrainChamp games and neuropsychology.\n\nJob Responsibilities:\n• Design and develop the logic for a web -based game  \n• Set up end to end game flow from launching on the platform to exporting  metadata for neuropsychological assessment  \n• Optimize performance and player experience  \n• Work closely with the UI designer to implement/improve visual and animations  \n• Work with neuropsychologist professor to analyze games -related data and co - \npublish an academic paper on the relationship between Brain Champ games and  \nneuropsychology  \n\nJob Requirements:\n• Priority will be given to candidates who demonstrate eagerness to step out of  comfort zone and learn new skills  \n• Candidates with knowledge of any programming language(s) are preferred",
        "email": "admin@brainchamp.org",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Games Development & Data Analytics Intern at BrainChamp Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to BrainChamp Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Actuarial Aqua Company",
        "job_position": "Educational Platform Developer",
        "job_description": "Job Description:  • Develop course platform, a platform for students to learn coding including (python, java script , C++, etc.)  Job Requirements:  • Front-End Development: Utilizing modern front-end frameworks and libraries • Back-End Development: Implementing back-end services data  • Cloud Computing Platforms: Leveraging services to host the platform, ensuring scalability and reliability. • Database Technologies: Working with SQL and NoSQL databases to store and retrieve data efficiently.  • Data Modeling: Designing database schemas that are optimized for the platform's specific needs, like tracking user progress and storing code submissions.  • Integrated Development Environments (IDEs): Developing or integrating online IDEs that allow for real-time coding and instant feedback within the browser.  • Code Execution Engines: Building a secure system to compile and run user-submitted code in various programming languages.",
        "email": "recruitment@actuarialedu.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Educational Platform Developer at Actuarial Aqua Company. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Actuarial Aqua Company. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Adbees Digital Limited",
        "job_position": "Digital Marketing Intern",
        "job_description": "Job Description:\n• Basic understanding of marketing concepts and principles of SEO and SEM\n• Assist with digital marketing campaigns via Metadata, Facebook/Instagram, \nLinkedIn, Google Ads, Reddit, and Spotify to maximize ROI\n• Engage in website analysis to ensure content is op timized\n• Engage in keyword Research and link -building opportunities\n• Startup culture with fun and collaborative working environment\n• Space to learn and contribute creative ideas\n\nJob Requirements:\n• Purusing  an undergraduate degree (any discipline) in one of the universities in \nHong Kong\n• Have experience in managing social media/ marketing development\n• Demonstrate a strong passion in marketing/social media management \nPreferential skills & experience\n• Willing to film short videos / take photos for promotion of our company\n• Strong presentation skills and creativity\n• Have experience in making YouTube videos or Instagram page \nOthers:\n• Good command of both spoken and written English and Chinese (Cantonese)\n• Good pr esentation and communication skills\n• Good problem -solving skills\n• Good team player, willing to learn and self -motivated",
        "email": "info@adbeesdigital.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Digital Marketing Intern at Adbees Digital Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Adbees Digital Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "ALGOGENE FINANCIAL TECHNOLOGY COMPANY LIMITED",
        "job_position": "Quant Researcher",
        "job_description": "Job Description: \n• Apply data analysis, modeling, machine learning, to design and develop realtime algorithmic trading models \n• Build, enhance and support research and trading tools \n• Assist in research and backtest on new trading strategies \nJob Requirements: \n• Good Mathematical knowledge (eg. Probability, Optimization, Multivariate Time Series, Stochastic Calculus, etc) \n• Strong programming skills (eg. Python, C++, OO, distributed/ concurrent architect, etc)  \n• Preferred relevant experience in data management with good knowledge in one or more data technology (eg. NoSQL, Spark, Flink, Kafka, Hadoop, Tensorflow, etc) \n• Good knowledge in financial product, market and trade life cycle (eg. FX, Equities, Futures, Options, etc) \n• Preferred hand-on data modelling and machine learning experience (eg. ANN, MDP, NLP, etc)",
        "email": "tonylam@algogene.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Quant Researcher at ALGOGENE FINANCIAL TECHNOLOGY COMPANY LIMITED. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to ALGOGENE FINANCIAL TECHNOLOGY COMPANY LIMITED. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Alphabag Limited",
        "job_position": "Software Design/Engineering Intern",
        "job_description": "Job Description:\n• Collaborative Development:\n- Work closely with CEO Kevin Hon to apply design thinking in the development process.\n- Participate in brainstorming sessions and contribute to the overall design and functionality of the application.\n• Backend Development:\n- Develop and maintain a Node.js and Express.js backend server.\n- Implement necessary functions to enhance user onboarding and improve the overall user experience.\n• LLM Integration Projects:\n- Work on small projects that leverage different Large Language Models (LLMs) such as GPT -4 and Gemini.\n- Develop features that help users auto -scope creative projects using these advanced AI models.\n• Application Development:\n- Use Google's Flutter framework to code the application.\n- Follow clean architecture practices to ensure maintainability and scalability of the codebase.\n• Project Page Development:\n- Use Nest.js to build shareable project pages.\n- Ensure these pages effectively communicate project status and updates.\nJob Requirements:\n• Basic knowledge of Node.js and Express.js for backend development.\n• Familiarity with Flutter for cross -platform mobile application development.\n• Understanding of Nest.js for building scalable server -side applications.\n• Experience or interest in working with Large Language Models (LLMs) such as GPT -4 or Gemini.\n• Basic knowledge of clean architecture principles and design thinking methodologies.",
        "email": "kevin@alphabag.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Software Design/Engineering Intern at Alphabag Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Alphabag Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Axios Investment and Consulting Limited",
        "job_position": "SEO and digital marketing specialist",
        "job_description": "Responsible for promoting the online learning platform and tools, attract followers, and drive exposures. This role focuses on using technologies to attract visitors and drive enrollment through a combination of digital marketing strategies and social media engagement. Interns should have an understanding of digital marketing strategies, social media platforms, and understanding marketing techniques.",
        "email": "aprimecentre@gmail.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the SEO and digital marketing specialist at Axios Investment and Consulting Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Axios Investment and Consulting Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "BLINK Gallery Limited",
        "job_position": "Art & Technology Intern",
        "job_description": "Blink Gallery, a leading contemporary art gallery, is seeking a talented and tech-savvy \nArt & Technology Intern to join our team. This is an exciting opportunity for students with a strong background in STEM- related fields to contribute to the intersection  of art \nand technology.  \nResponsibilities:  \n• Assist our artists in developing cutting-edge, technology-driven art projects and \ninstallations  \n• Explore the use of augmented reality (AR) to enhance the visitor experience \nwithin our art exhibitions  \n• Create engaging and visually compelling animated digital content (e.g., motion \ngraphics, interactive experiences) to complement the gallery's programming  \n• Collaborate with the curatorial and technical teams to ideate, prototype, and implement innovative solutions that push the boundaries of art and technology \n• Research technologies and trends in the art world, and identify opportunities for \n their application  \n• Support the setup, testing, and troubleshooting of art- tech projects to ensure a \nseamless visitor experience  \n• Analyze user feedback and data to continuously improve the impact and effectiveness of the gallery's art and technology initiatives  \n \nThis is a paid internship opportunity with the potential for future employment. If you are excited to contribute to the innovative and cutting- edge projects at BLINK Gallery, \nwe encourage you to apply today!  \nJob Requirements:  \n• Strong technical skills in areas suc h as programming, 3D modeling, motion \ngraphics, or AR/VR development  \n• Proficient in using various digital design and prototyping tools (e.g., Adobe \nCreative Cloud, Unity, Unreal Engine)  \n• Excellent problem-solving and critical- thinking abilities, with a kee n eye for \ndetal  \n• Passion for the arts and a desire to explore the intersection of creativity and \ntechnology  \n• Exceptional communication and collaboration skills, with the ability to work \neffectively with artists and cross -functional teams  \n• Familiarity with emerging trends and best practices in art, technology, and user \nexperience design  ",
        "email": "info@blinkgalleryhk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Art & Technology Intern at BLINK Gallery Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to BLINK Gallery Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Blissmi Limited",
        "job_position": "Business Development Intern",
        "job_description": "As a Business Development Intern, you will play a crucial role in expanding Blissmi's network of health and wellness service partners globally. You will also be responsible for identifying and pursuing potential partnerships with femtech solutions.  Responsibilities:  \n• Research and identify potential health and wellness service partners and femtech solutions that align with Blissmi's mission and target market.  \n• Conduct thorough research on potential partners, including their services, target audience, and market position.  \n• Develop effective outreach strategies to initiate contact with potential partners.  \n• Pitch Blissmi's value proposition to potential partners and build strong relationships.  \n• Negotiate partnerships and contracts with selected partners.  \n• Assist in the onboarding process for new partners.  \n• Track and report on key performance indicators (KPIs) related to business development activities.  \n• Support the business development team in various administrative tasks.  \n\nJob Requirements:   \n\n• Strong communication and interpersonal skills.  \n• Excellent presentation and pitching abilities.  \n• Ability to build and maintain strong relationships with partners.  \n• Strong research and analytical skills.  \n• Attention to detail and organizational skills.  \n• Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint).  \n• Interest in the health and wellness industry and women's health.",
        "email": "blissmi@ideabeedesign.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Business Development Intern at Blissmi Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Blissmi Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "EC Innovation Limited",
        "job_position": "ESG Business Analyst Intern",
        "job_description": "• Analyze environmental data extracted from global landscape through Excel and Python\n• Create dashboards to visualize ESG-related data and generate insights for reporting to customers\n• Improve UI/UX design and create graphic content for company website\n• Co-create workshops for secondary school students and explain the electrocatalytic techno logy principles behind\n• Design digital marketing content for company social media and website\nJob Requirements:\n• Students from all disciplines are eligible to apply\n• Priority will be given to candidates who demonstrate eagerness to step out of comfort zone\n• Candidates with good critical thinking skills are preferred",
        "email": "jacksonyip@ecinno.tech",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the ESG Business Analyst Intern at EC Innovation Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to EC Innovation Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Energybox Limited",
        "job_position": "Data Analytics Intern",
        "job_description": "• Using APIs to fetch sensor data and meta -data from our platform and databases  \n• Cleaning, manipulating, and visualizing time series data with Python, pandas,  matplotlib  \n• Designing, prototyping, and implementing analytics algorithms using Python,  scikit -learn, and other packages for statistics, clustering, and prediction  \n• Maintain and enhance existing analytics feature on our IOT platform under  software development principle and process  \n• Research on data analytics methodologies leveraging in -house data and  external data Ad -hoc data analysis by requests from business team  \n• Communicating analytics results with the rest of the team using Google Collab  or Jupyter Notebooks  \n• Understanding common patterns in temperature and energy data of cold storage  and HVAC equipment  \n• Using git and Github to push code to a shared code -base, resolving merge  conflicts, reviewing pull requests",
        "email": "careers@energybox.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Analytics Intern at Energybox Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Energybox Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Finstep Asia Limited",
        "job_position": "Proof of Concept Product Development Intern – Data Science/AI",
        "job_description": "Finstep Asia, at the cutting edge of fintech and blockchain innovation in Asia, is seeking a skilled AI Developer.  This role is pivotal in developing an Artificial Intelligence tool that will be integrated with a proof -of-concept product aimed at mitigating trad ing risks in the virtual assets industry.  In this role you will be expected to:  Possess strong coding and programming skills in python for the development of sophisticated software solutions.  Apply technical expertise to design and build Artificial Intel ligence tools that enhance trading risk management in the virtual assets industry.  Develop and integrate an AI tool with the PoC product to enhance trading risk analysis in virtual assets.  Collaborate with regulatory bodies and leading fintech/blockchain  companies to align the AI tool with industry standards and needs.  Work closely with senior industry professionals, absorbing knowledge and contributing to significant project milestones. Job Requirements:  Have a keen interest in Fintech and Virtual Ass ets  Have strong analytical skills  Have good communication skills  Have strong ability to conceptualize and execute on instructions  Be creative  Self-starter  Ability to do coding/programing to build Artificial Intelligence tools  Background in Data Science is useful  Be well organized and able to work remotel  Be a team player",
        "email": "Finstep_Asia@ideabeedesign.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Proof of Concept Product Development Intern – Data Science/AI at Finstep Asia Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Finstep Asia Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "GrinBean Hong Kong Limited",
        "job_position": "AI Robotics Engineer",
        "job_description": "This role focuses on controlling robotic arms using the Jetson Nano platform, utilizing computer vision techniques like YOLO (You Only Look Once) to enable real -time object detection and decision -making for robotic tasks. \n\nKey Responsibilities:\n• Robotic Arm Control: Design and implement control algorithms for robotic arms, ensuring precise manipulation based on real -time AI feedback from visual inputs.  \n• AI & Computer Vision Integration: Develop and integrate AI models (specifically YOLO) for object detection, allowing the robotic arm to interact intelligently with its environment based on camera data.  \n• Jetson Nano Development: Leverage the NVIDIA Jetson Nano platform for real-time processing of AI models and robotic control, ensuring optimized performance on embedded hardware.  \n• System Testing and Optimization: Perform rigorous testing and fine -tuning of the AI -robotics system to meet performance benchmarks. Identify and resolve any integration issues.  \n• Documentation and Communication: Maintain detailed technical documentation of development processes, algorithms, and results. Communicate progress and challenges to stakeholders and team members effectively.  \n• Cross -functional Collaboration: Collaborate with AI specialists, hardware engineers, and project managers to ensure cohesive system development and successful deployment.  \n\nJob Rqeuirements: \n• Bachelor’s degree in Robotics, Computer Science, AI, Electrical Engineering, or a related field  \n• Solid experience in controlling robotic systems with a focus on AI -driven control mechanisms.  \n• Expertise in computer vision techniques, particularly using YOLO and similar AI frameworks.  \n• Proficiency in Python, C++, and familiarity with NVIDIA’s Jetson Nano platform.  \n• Strong understanding of GPU programming and embedded systems.  \n• Experience with ROS (Robot Operating System).  \n• Background in machine learning and neural networks.  \n• Experience with sensor integration and real -time data processing.  \n• Excellent problem -solving skills, creativity, and attention to detail.",
        "email": "info@grinbean.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI Robotics Engineer at GrinBean Hong Kong Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to GrinBean Hong Kong Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "iGears Technology Limited",
        "job_position": "Intern -Programmer",
        "job_description": "• Responsible for system design, development, testing and analysis of applications and websites\n• Collect user requirements and perform technical analysis\n• System Design and specification writing\n• Implement and maintain systems and websites\n• Test on different browsers\n• Communicate with managements and teams to achieve company goals and targets.\n\nJob Requirements:\n\n• Proficient in PHP, HTML, HTML5, CSS, JavaScri pt, SQL is required.\n• Experience in open source CMS platforms such as Word Press, Joomla, Drupal or Magento is an advantage.\n• Experience in development on mobile platforms is an advantage.\n• Experience in Websphere, C# is an advantage\n• Interest and Actively research on new web technologies.",
        "email": "hr@igears.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Intern -Programmer at iGears Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to iGears Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "iSEE Mobile Limited",
        "job_position": "Software Engineer",
        "job_description": "• Revamp an online education platform by enhancing the user interface with cutting -edge design principles and user experience (UX) strategies.  \n• Leverage data analytics to gain insights from user behavior and preferences, informing targeted improvements.\n• Propose and implement innovative modules utilizing emerging technologies such as artificial intelligence and machine learning to personalize learning experiences and optimize content delivery.\n• By embracing these technological advancements, the platform aims to create a dynamic and adaptive online education ecosystem that meets the evolving needs of learners with special needs.  \n\nJob Requirements:\n• Have basic understanding in programming languages (e.g., HTML, CSS,  JavaScript) and familiarity with website development frameworks  \n• Ability to identify issues and develop innovative solutions to enhance user experience  \n• Willingness to learn new technologies and adapt to changing project requirements",
        "email": "info@iseemobile.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Software Engineer at iSEE Mobile Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to iSEE Mobile Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Lemma Company Limited",
        "job_position": "Marketing Assistant Intern",
        "job_description": "• Develop and implement online marketing strategies: Collaborate with the team to create effective online marketing strategies that align with the channel's goals and target audience. \n• Social media management: Create engaging content, brainstorm video contents and edit vidoes, schedule posts, and interact with followers to build a strong online community. Develop and execute promotional campaigns to increase the visibility and reach of our YouTube channel. \n• Analytics and reporting: Monitor and analyze channel  performance using \nYouTube analytics and other relevant tools. Provide regular reports on key metrics such as views, engagement, and subscriber growth, and use the insights gained to optimize marketing strategies. \n• SEO optimization: Stay up -to-date with th e latest SEO trends and techniques to \noptimize video titles, descriptions, tags, and thumbnails for maximum visibility and discoverability on YouTube. Improve SEO settings for company website. \nJob Requirements: \n• Basic knowledge in marketing, social media and IT is preferred.  \n• Creative mindset: Ability to think creatively and develop innovative marketing \nideas to promote our channel effectively.  \n• Strong visual and written communication skills would be preferred.  \n• Team player: Willing to learn. Ability to work collaboratively as part of a team while also being self -motivated and proactive in individual tasks.",
        "email": "info@lemmacom.top",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Marketing Assistant Intern at Lemma Company Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Lemma Company Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "LY Relationship Limited",
        "job_position": "Website Deve lopment Intern",
        "job_description": "• Manage and develop engaging digital content e.g. videos, graphics for clients  \n• Improve SEO to increase online traffic  \n• Responsible for digital marketing campaigns and e -commerce  \n• Assist in making website via Wix/Wordpress Assist in adhoc tasks  \n\nJob Requirements:  \n• Be a good team player and be able to work independently  \n• Good presentation skills in English and Chinese  \n• Good sense in graphic design and layout  \n• Be able to prioritise  tasks, arrange schedule, and complete tasks on time",
        "email": "cs@lyrelationship.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Website Deve lopment Intern at LY Relationship Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to LY Relationship Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Mindplus AI Limited",
        "job_position": "AI Engineer",
        "job_description": "• Design and develop AI algorithms for analyzing OCT medical images\n• Collaborate with other team members to implement and optimize AI models\n• Conduct experiments and evaluate the performance of AI models\n• Stay up -to-date with the latest developments in AI and machine learning",
        "email": "recruit@mindplusaihk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI Engineer at Mindplus AI Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Mindplus AI Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Recreate System Limited",
        "job_position": "IT Software Developer",
        "job_description": "Job Objective:\n• Cultivating a technology-driven mindset.\n• Exploring opportunities within the technology industry and gain practical experience.\n• Gaining familiarity with IT projects and enhance individual competitiveness for future career prospects.\n\nJob Description:\n• Providing assistance in ERP/CRM projects\n• Managing coding tasks involving SQL, Python, debugging, etc.\n• Performing documentation for IT projects\n\nJob Req uirements:\n• Knowledge and experience of coding, especially Python \n• Proficient in MS Excel, Word and PowerPoint\n• Good command of spoken and written English and Chinese\n• Students who are having gap semester / gap year / postgraduate are all welcome\n• Team player, detail-oriented, responsive and self-motivated\n",
        "email": "info@recreatesys.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the IT Software Developer at Recreate System Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Recreate System Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "RightPick Technology Limited",
        "job_position": "Project intern",
        "job_description": "Technical project management\n• Website page enhancement\n• Competition Application\n• Research, e.g. market size, university exam system\n• Digital marketing\n\nJob Requirements:\n\nStudying Bachelor degree in STEM related subjects currently",
        "email": "rp@rightpickhk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Project intern at RightPick Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to RightPick Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Sigtica Limited",
        "job_position": "Data Analyst Intern",
        "job_description": "• Utilize Sigtica's  cutting -edge AI tools and software to collect, organize, and  analyze data in order to identify patterns, trends, and insights relevant to Sigtica's  clients.  \n• Collaborate with Sigtica's data science team to develop and implement innovative  AI solutions usi ng in -house tools that improve data collection, analysis, and  reporting processes. \nJob Requirements:  \n• Background in any STEM discipline, such as Computer Science, Software  Engineering, Data Science, or a related field.  \n• Proficiency in programming languages such as Python is preferred. Familiarity  with cloud -based data storage and processing technologies is  preferred but not  required.  \n• Familiarity with computer vision and NLP technologies is a plus.  \n• Strong analytical and problem -solving skills.  \n• Excellent written and verbal communication skills.  \n• Ability to work collaboratively in a team environment.",
        "email": "careers@sigtica.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Analyst Intern at Sigtica Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Sigtica Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "SNAILDY EDUCATION LIMITED",
        "job_position": "Artificial Intelligence R&D Assistant",
        "job_description": "Job Description:\n• Research and Development: Assist in the development and implementation of  AI models and algorithms.  \n• Data Analysis: Collect, process, and analyze data to support AI projects.  \n• Documentation: Maintain clear and detailed records of research processes and  findings.  \n• Collaboration: Work closely with the AI research team to brainstorm and  innovate new solutions.  \n• Prototyping: Help build and test AI prototypes and applications.  \n• Stay U pdated: Keep up with the latest developments in AI technology and  research .\nJob Requirements:  \n• Strong analytical and problem -solving skills.  \n• Experience: Prior experience in AI or machine learning projects is a plus.  \n• Communication: Excellent written and v erbal communication skills.",
        "email": "patrick.lau@snaildy.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Artificial Intelligence R&D Assistant at SNAILDY EDUCATION LIMITED. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to SNAILDY EDUCATION LIMITED. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "TadReamk Limited",
        "job_position": "Research and Development Internship",
        "job_description": "The successful candidate will be expected to participate in a variety of research and development activities. We acknowledge that an intern's drive is not solely rooted in financial reward but also in a thirst for developing their abilities and acquiring a  breadth of experiences that contribute to their future professional growth. Therefore, we will offer a selection of job tasks from which the candidate can choose their right combination, aligning with both the company's needs and their personal interests.  This includes but not limited to the following set of tasks:  \n1. Work in collaboration with the research team on computer vision, natural \nlanguage processing and general machine learning projects, where the student \nis expected to contribute to the development of research ideas.  \n2. Work in collaboration with the research and development team, to perform data \ncuration tasks, from data acquisition to labelling.  \n3. Work closely with the development team to bring new features to life, \ntranslating designs and wireframes into high -quality code. Work with backend \ndevelopment teams to achieve smooth integration between frontend and \nbackend components.  \n4. Document and disseminate expertise and insights with fellow team members.  \n5. Support other company tasks, including pitching and marketing activities.  \n\nJob Requirements:  \n1. University students in computer science, engineering or related field.  \n2. Proficiency in Python programming and a passion for machine learning and \nartificial intelligence.  \n3. Strong problem -solving skills and a good team player.  \n4. Possess the ability to work autonomously, demonstrate creativity, and show \nself-motivation with the capacity to adhere to a stringent timeline.  \n5. At least 16 hours per week with flexible working time and arrangement.",
        "email": "general@tadreamk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Research and Development Internship at TadReamk Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to TadReamk Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "TVC Management Limited",
        "job_position": "Investment Associate (Buy -side Internship)",
        "job_description": "• Participate in market and industry research.\n• Assist our investment team in carrying out duties in the investment process, with an emphasis on data analytics related to macroeconomics, industry trends, and financial modelling.\n• Provide support to the middle office in following operational procedures and system automation.\n• Perform ad -hoc tasks.\n\nJob Requirements:\n• Student or degree holder, major in Finance, Information Analytics, Computer Science, or related STEM disciplines.\n• Proficiency in computer applications and information system management, such as VBA, Python, Excel, Word and PowerPoint, etc.\n• Strong and committed career objectives, interests, and experiences in financial sector, particularly in asset management will be first considered.\n• A team player, pleasant personality and able to work under pressure.\n• Exceptional written communication and presentation skills.",
        "email": "irene@tvcmgmt.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Investment Associate (Buy -side Internship) at TVC Management Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to TVC Management Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Vinci Analytics Limited",
        "job_position": "Data Scientist Intern",
        "job_description": "We are seeking a highly motivated Data Scientist Intern to join our team in developing Vinci AI Tutor, an innovative AI-powered educational platform. You will play a crucial role in analyzing educational data, building machine learning models, and evaluating the effectiveness of our AI tutor. Responsibilities:  Assist in collecting, cleaning, and pre-processing educational data from various sources. Develop and implement machine learning models to personalize learning paths, predict student performance, and generate insightful analytics. Evaluate the performance of AI models and algorithms, identifying areas for improvement. Collaborate with the software engineering team to integrate AI models into the Vinci AI Tutor platform. Stay up-to-date with the latest advancements in AI and EdTech.  Job Requirements: Currently pursuing a Bachelor's or Master's degree in Computer Science, Data Science, Statistics, or a related field. Strong understanding of statistical concepts and machine learning algorithms. Experience with data manipulation and analysis using Python or R. Familiarity with machine learning libraries such as scikit-learn, TensorFlow, or PyTorch. Excellent problem-solving and analytical skills. Strong communication and teamwork skills. Passion for education and leveraging technology to improve learning outcomes.",
        "email": "contact@vinciai.academy",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Scientist Intern at Vinci Analytics Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Vinci Analytics Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Visual Earth Limited",
        "job_position": "Robotic/ Electrical/ Computer Engineer Intern",
        "job_description": "In this internship, you will be working with a small, dynamic team pushing innovations in the pet industry. With us, your Job will include: 1. Building a heart rate sensor for pets 2. Connecting electronic parts and soldering 3. Programming microprocessors 4. Sending data into cloud from the smart vest 5. Using AI for classification and prediction Job Requirements: 1. Proficient in working with electronic components and sensors. 2. Experience wit h microprocessors. 3. Basic programming skills. 4. Knowledge of establishing networks between microprocessors. 5. Familiarity with basic AI model training concepts.",
        "email": "visual_earth@ideabeeDesign.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Robotic/ Electrical/ Computer Engineer Intern at Visual Earth Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Visual Earth Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Vitalogy Limited",
        "job_position": "AI Development Intern",
        "job_description": "We are seeking a passionate and driven AI Development Intern to assist in the development of our AI nutritionist, Eve. This role offers the opportunity to work alongside experienced engineers, data scientists, and nutrition experts to enhance the functionality, accuracy, and user experience of Eve. As an intern, you will contribute to core AI features, support machine learning model optimization, and collaborate on new product features.  \n\nKey Responsibilities:\n• Assist in the development, training, and fine -tuning of AI models related to nutrition and user behavior.\n• Work with large datasets to improve Eve’s personalization algorithms.\n• Collaborate with cross -functional teams to integrate new features and improve user experience.\n• Conduct research on nutrition trends, user behavior, and AI advancements to support product innovation.\n• Test, debug, and optimize code for efficiency and accuracy.\n\nWhat We Offer:\n• Hands -on experience working on a cutting -edge AI product.\n• Mentorship from industry experts.\n• Opportunity to impact real-world health and wellness through technology.\n• Flexible work hours and a supportive, inclusive work culture.\n",
        "email": "nick@vitalogy.ai",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI Development Intern at Vitalogy Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Vitalogy Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    }
]