[
    {
        "company_name": "Peddy Pet Caring Hero Limited",
        "job_position": "Digital Market Developer",
        "job_description": "• Assist in the planning and execution of various digital channels, including SEO/SEM, Google Ads, database marketing, email, and social media.\n• Assist in coordinating advertising and marketing support, including influencer, social media, and other digital ads, to drive sales on these channels.\n• Assist in gathering information and supporting the measurement and reporting of the performance of digit al marketing campaigns against goals (ROI and KPIs).\n• Collaborate and communicate effectively with internal teams and external parties to support the planning and execution of website development projects.\n\nJob Requirements:\n• For the students who are studying in Business, Computer Science, Information Technology degree.\n• Strong understanding of digital marketing, including data analysis, acquisition, and performance marketing.\n• Excellent command of written and spoken English and Chinese, with strong interpersonal skills.\n• Passion for digital communication techniques and technologies.",
        "email": "jobs@furrypet.co",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Digital Market Developer at Peddy Pet Caring Hero Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Peddy Pet Caring Hero Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Pet Pet Club Limited",
        "job_position": "Data Engineer",
        "job_description": "Analyze and organize raw data Build data systems and pipelines Interpret trends and patterns Conduct complex data analysis and report on results Prepare data for prescriptive and predictive modeling Combine raw information from different sources Explore ways to enhance data quality and reliability Identify opportunities for data acquisition Develop analytical tools an d programs Collaborate with data scientists and architects on several projects",
        "email": "hr@petpetclub.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Engineer at Pet Pet Club Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Pet Pet Club Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Pokeguide Limited",
        "job_position": "Spatial Data Management Specialist (Summer)",
        "job_description": "• As one of the leading navigation app and smart city tech in Asia, we are seeking a motivated person to join our team to be responsible for managing our spatial data in east Asia excluding China. You will be responsible for: \n• Develop and implement data collection strategies to ensure data accuracy and completeness. \n• Collect, analyze, and manage spatial and transportation data to maintain data accuracy and integrity. \n• Cross-check data with real life observation and user-generated review. \n• Provide support and expertise on spatial data and transportation related matters.\n\nJob Requirements \n• Full-time students, no preference on any major / curriculum / school. \n• Interest on either public transportation, geography, GIS or smart city initiatives is an advantage. \n• Strong analytical and problem-solving skills, and pay attention to details. \n• Not just come here to kill time, brush up the CV or have a regular boring simple job, but rather love to handle dynamic, ever-changing and challenging project tasks. \n• Energetic, fast learner, responsible, self-motivated, able to accomplish deadlines and able to develop himself in an open and entrepreneurial environment. \n• GPA is not an assessment criterion, attitude and enthusiastic in changing people’s lives is the key. \n• Both local and international students are welcome.",
        "email": "hr@pokeguide.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Spatial Data Management Specialist (Summer) at Pokeguide Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Pokeguide Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Preface Technopreneur Limited",
        "job_position": "Summer Internship Program",
        "job_description": "Summer Internship Program Running from July 2nd to August 23rd, the Internship Program offers comprehensive technical teacher training and an opportunity to be placed in one of the Company's business units based on business requirements and the Intern's preference. Over the course of 8 weeks, Interns will engage in hands-on teaching and participate in practical business events. The Program aims to provide a thorough understanding of the tech education industry by exposing Interns to various aspects of the business; and to enhance Interns’ technical knowledge, communication skills, and business acumen.   What will you experience?  \n• On-the-job training to hone programming teaching skills supported by the latest technology such as A.I. recommended teaching metho ds and learning materials  \n• Hands on teaching experience on coding for kids, teenagers and/or young adults in a 1:1 or group setting to inspire them programming is part of their daily life in the days ahead  \n• Collaborate in content product team on lesson plan ning, material preparation, and progress determination powered by A.I. platforms with data driven approach  \n• Involve in projects such as internal training, hackathons, external events in our coffee and wine space and a variety of business activities promoting latest technology trend such as Blockchain, Web 3.0 and ChatGPT  \n• Take part in different parts of the business to gain hands-on experience on various business functions with support of latest technologies, platforms and tools  \n• Involve in iterating a UX/UI friendly web production system and maintain its operational stability Support and maintain internal har dware, software and systems .  \n\nJob Requirements :  \n• Undergraduate students from Computer Science, Computer Engineering, Data Science, Information Technology or related disciplines (Year 3 & 4 preferred)  \nStrong enthusiasm and passionate to teach and mentor kid s, teenagers and / or young adults Creative, digital -savvy, detail -minded, proactive with high  \nlearning agility  \n• Good analytical, communication and interpersonal skills Excellent written and  \nspoken English  ",
        "email": "hanink@hanink.my.id",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Summer Internship Program at Preface Technopreneur Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Preface Technopreneur Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "QualiFly Education Limited",
        "job_position": "AI Product Management Intern",
        "job_description": "Al is a fast-growing and exciting trend that affects everyone in every sector. As an Al product management intern, you will be responsible for some of the following exciting and rewarding tasks: \nAssist in the development of cutting-edge Al products in the education sector \nCollaborate closely with the product team to understand and transiate product requirements into actionable plans \nSupport the entire product lifecycle, from conceptualization to launch, by actively contributing to product development and refinement \nStay updated on Al product market trends and competitor activities to identify potential areas for product innovation and differentiation \nWork in a dynamic startup environment, gaining hands-on experience and exposure to various aspects of product management \nContribute to cross-functional teams, collaborating with engineers, designers, and other stakeholders to deliver high-quality Al products \nActively participate in brainstorming sessions and provide valuable insights and ideas to enhance product features and user experience \nGain valuable Industry experience while working on innovative Al solutions that have the potential to make a significant impact in the education sector  Job Requirements: \nWe are seeking a talented and passionate AI Product Management Intern to join our dynamic startup team. In this role, you will have the opportunity to contribute to the development of cutting-edge AI products for the education sector. We look for students with: \nPassion for education and a desire to contribute to the development of transformative AI-powered solutions \nStrong analytical and problem-solving skills, with a keen interest in AI and its applications \nExcellent communication and interpersonal skills, with the ability to work effectively in a team \nFamiliarity with product management methodologies and understanding of the product development lifecycle \nHands-on experience with data analysis, prototyping, and user research would be an advantage \nPursuance of a degree in a relevant field is a plus",
        "email": "contact@qualiflyhk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI Product Management Intern at QualiFly Education Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to QualiFly Education Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Radiance Tech International Limited",
        "job_position": "Junior Programmer",
        "job_description": "We are looking for a talented programmer to create secure and functional code. You may have to provide quality coding solutions both for simple applications and complex information.\n\nJob Requirements\n• Studying Computer Science, Information Technology and Engineering related disciplines\n• Experience in Unity, C#/C++, Javascript, PHP etc programming are preferred\n• Self-motivated and good team player",
        "email": "hr@radiance.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Junior Programmer at Radiance Tech International Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Radiance Tech International Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Rechips Limited",
        "job_position": "R&D Special ist ( Intern )",
        "job_description": "Assist R&D team in researching and developing innovative upcycling methods.\nConduct experiments, collect data, and analyze results. Collaborate with cross -functional teams to refine product designs and prototypes. Stay updated on industry  trends and advancements in upcycling and sustainability. Support R&D projects,  document findings, and contribute to reports and presentation s.\n\nJob Requirements:\n• Ability to conduct experiments, collect data, and analyze results. Strong  problem -solving skills and attention to detail.\n• Eagerness to learn and contribute to the research and development projects of  the company.\n• Strong commitment to quality, accuracy, and innovation.\n• Internship or prior experience in a research and development role is desirable  but not mandatory.",
        "email": "info@rechips.co",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the R&D Special ist ( Intern ) at Rechips Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Rechips Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Recreate System Limited",
        "job_position": "Project Consultant Intern",
        "job_description": "Role and Responsibilities\n• Work with Project Manager to gather ERP CRM system and user requirements and business needs\n• Work closely with technical consultant to communicate user requi rements and ensure the successful implementation Odoo ERP, inventory, accounting system and CRM focused\n• Develop test plan, scenarios and cases for project delivery\n• Conduct User Acceptance Testing (UAT) to meet quality standards\n• Assist in troubleshooting, and follow up on bugs and errors with development team\n• Assist in project management\n• Ad hoc project assignment\n\nJob Requirements\n• Self-motivated and willing to learn\n• Good presentation and communication skills\n• Good in both spoken and written English and Chinese",
        "email": "info@recreatesys.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Project Consultant Intern at Recreate System Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Recreate System Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Recreate System Limited",
        "job_position": "Internship - IT Developer/ Coding/ Programmer",
        "job_description": "As an IT Developer Intern, you will work directly under the guidance of our Project Managers and Technical Consultants to enhance and expand our ERP, inventory, and accounting systems. You will play a critical role in the backend development, ensuring seamless integration and efficient functionality of our systems.\n\nKey Responsibilities:\n• Collaborate with project teams to understand and program ERP/CRM systems according to user requirements and business needs.\n• Create detailed test plans, scenarios and cases to support effective project delivery.\n• Conduct User Acceptance Testing (UAT) to ensure adherence to quality standards.\n• Assist in debugging, tracking, and resolving software bugs in collaboration with the development team.\n• Familiarity with AWS Cloud deployment and API integration is considered a plus.\n• Handle ad hoc project assignments as needed.\n\nJob Requirements:\n\n• Previous Python programming experience, particularly in website implementation, API integration, or Odoo applications, is highly advantageous.\n• Strong motivation and a keen interest in IT development and Finance solutions.\n• Proficiency in both spoken and written English and Chinese.",
        "email": "info@recreatesys.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Internship - IT Developer/ Coding/ Programmer at Recreate System Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Recreate System Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "ReCube Limited",
        "job_position": "Full Stack App Developer (Summer Intern)",
        "job_description": "Role and Responsibilities\n• Web App design and implementation using React & Next.js Architect,\n• Implementation, deployment of native mobile applications on Android and IOS platforms\nThird-party service integration\n• Configuring of backend API, which is using AWS (Lambda & DynamoDB structure)\n• Database design, development, testing, implementation, enhancement and maintenance\n• Frontend and integration testing\nWork closely with UI/UX, product and backend engineering teams.\n\nJob Requirements\n• Degree in Computer Science, Computer Engineering, Information Engineering or related disciplines\n• Proficiency in any of (HTML, CSS, JavaScript or TypeScript)\n• Familiar with any of (Node.js, Next.js, React or React Native)\n• Proficiency with Git and version control systems\n• Self-motivated and able to work independently with minimal supervision\n• Passionate in startup culture and environment\nGood to have:\n• Experience in the core AWS services, including AWS Lambda, AWS Dynamo DB, S3 Bucket, AWS Amplify, EventBridge Scheduler, CloudFormation etc.\n• Familiar with database technology especially in NoSQL database design techniques\n• Experience in connecting with third-party APIs, and knowledge in payment gateways\n• Experience in mobile application development\nHaving Knowledge of UI/UX design",
        "email": "kelvin.tsui@recube.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Full Stack App Developer (Summer Intern) at ReCube Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to ReCube Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Revotech Limited",
        "job_position": "AI Tester and Developer",
        "job_description": "Work with data scientist to provide consultancy and build Large Language Model pipeline into web-based application for startups.\n• Create, test, and deploy well-designed and efficient code.\n• Explore new technologies to improve developer experience and engineering process.\n• Provide consultancy towards clients to navigate differing opinions, ambiguity, and requirements to build and advocate designs with clear objectives and trade-offs\n\nJob Requirements:\n• Enthusiastic, fast learner\n• Have Python background, with experience in prototyping LLM applications a priority\n• Strong work ethic, punctual",
        "email": "info@revotechhk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI Tester and Developer at Revotech Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Revotech Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "RightPick Technology Limited",
        "job_position": "Project Intern",
        "job_description": "Position 1: Project Intern\nJob Description \n• Technical project management \n• Website page enhancement \n• Research, e.g. market size, university exam system \n• Digital marketing\nAbout working hour \n• Flexible working hour (within 10:30-19:00)\n • Work from home / Hybrid mode -5-day work\nJob Requirements\nStudying Bachelor degree in STEM related subjects currently",
        "email": "rp@rightpickhk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Project Intern at RightPick Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to RightPick Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "RISKSIS TECHNOLOGY LIMITED",
        "job_position": "Data Engineer Intern",
        "job_description": "Job Description Data Annotation and Preparation for AI Projects\nFrontend Software Development and Scripting\nJob Requirements Attention to Details\nWilling to Learn\nBasic Web or Python Skills is preferable\nInternship Period: Summer Term 2024\nFull-time placements with a duration of no less than 4 consecutive weeks (28 calendar days)",
        "email": "alan.lee@risksis.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Engineer Intern at RISKSIS TECHNOLOGY LIMITED. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to RISKSIS TECHNOLOGY LIMITED. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "School of Data Science, City University of Hong Kong",
        "job_position": "Data Analysis Assistant",
        "job_description": "We are seeking a highly motivated and detail -oriented individual to join our team as a Data Analysis Assistant. This internship opportunity focuses on working with meta datasets related to elderly health in different countries around the world, providing valuable hands-on experience in data analysis and interpretation within a dynamic and innovative environment.  The primary tasks of this role include:  Assisting in organizing and cleaning large datasets from various sources, performing data preprocessing tasks such as data cleaning, transformation, and feature engineering, and applying statistical techniques and data mining algorithms to analyze complex d atasets and extract meaningful insigh  Job Requirements: Currently pursuing a degree in Data Science, Computer Science, Statistics, or a related field. Proficiency in programming languages such as Python, R, or SQL. Excellent proficiency in English reading and effective communication skills to convey complex data analysis findings.",
        "email": "linyanli@cityu.edu.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Analysis Assistant at School of Data Science, City University of Hong Kong. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to School of Data Science, City University of Hong Kong. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Sigtica Limited",
        "job_position": "Data Analyst Intern",
        "job_description": "• Utilize Sigtica's  cutting -edge AI tools and software to collect, organize, and  analyze data in order to identify patterns, trends, and insights relevant to  Sigtica's clients.\n• Collaborate with Sigtica's  data science team to develop and implement  innovative AI solutions using in -house tools that improve data collection,  analysis, and reporting processes.\nJob Requirements:\n• A STEM field such as Statistics, Mathematics, Economics, Computer Science,  or a re lated field.\n• Strong analytical skills and attention to detail.\n• Excellent written and verbal communication skills.\n• Ability to work collaboratively in a team environment.\n• A passion for using data to drive decision -making.",
        "email": "careers@sigtica.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Analyst Intern at Sigtica Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Sigtica Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Smart Business Consultancy Limited",
        "job_position": "Programmer Trainee",
        "job_description": "Develop mobile & online application\nResponsible for the backend / front end (UI/UX) development\nSpecification gathering, documentation and design\nCarry out system analysis, system/database design\nPerform coding, debugging, peer review and unit / functional testing\nPresent solutions to customers and collect user requirements\n\nJob Requirements:\n\n• Self-starter. Ability to learn quickly on the go and to work independently\n• Enthusiastic with clean code and able to solve complex problem in a simple way\nWhat you'll need:\n• Degree or above in AI, Big Data, Computer Science or related disciplines\n• Experience experience in Python, PHP, Javascript, jQuery, CSS, HTML & MYSQL\n• Strong desire to learn new technologies\n• Can work independently as well as work as a team\n• Innovative, self -motivated, well -organised and with strong problem -solving skills\n• Good command of spoken English or Cantonese preferred",
        "email": "spencer@smartbusiness.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Programmer Trainee at Smart Business Consultancy Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Smart Business Consultancy Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Smart Goat International Limited",
        "job_position": "Software Developer (STEM)",
        "job_description": "Job Description:\n\t• Development and coding implementation of B2C & B2B solutions\n\t• Perform web development according to functional and technical requirements.\n\t• Customize the software to improve business processes. UX Web APIs and mobile app development\n\nJob Requirements:\n\t• Knowledge and experience in database communication and software development\n\t• Enjoy what you are doing and be interest in the latest web technology, development practices, techniques, and trends.\n\t• Hi-Diploma or above in Computer Science/ Information Technology or equivalent.\n\t• Highly collaborative and proactive in sharing new ideas.\n\t• Hardworking, self-motivated, Mature, responsible, careful Fields of Study Computer Science & Engineering, Computer Science, Information Technology or equivalent.",
        "email": "info@smartgoat.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Software Developer (STEM) at Smart Goat International Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Smart Goat International Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "SMART WING TECHNOLOGY LIMITED",
        "job_position": "IT intern",
        "job_description": "Job Description\n• To provide support in managing IT projects ;\n• To assist in conducting research and analysis on IT risk matters; and\n• To support other IT projects as assigned.\nJob Requirements\n• University undergraduate (majoring in Science, Computer Science, Information Technology or related disciplines will be a plus)\n• Fluent in written and spoken English and Chinese;\n• Proficient in PC applications including MS Word, MS Excel and MS PowerPoint.",
        "email": "info@smartwing.info",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the IT intern at SMART WING TECHNOLOGY LIMITED. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to SMART WING TECHNOLOGY LIMITED. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "SmartAge Intelligence Limited",
        "job_position": "Data Scientist AI",
        "job_description": "Work in our R&D team which was led and mentored by our solution architect to research the better solution in the following product areas:  1. Elderly Smart Home open solution (GeronTech) o Data collection from our GeronTech/AIoT solution and analysis of the data to provide insight to support our caring service (Angel Eyes service) 2) Digital Healthcare Data Marketplace o Structures the health data with the underlying blockchain and NFT technology to enable elderly health records sharing and increases the security, privacy, and interoperability of health data Included typical tasks with our mentor supervise: • Worked with our R&T team and solution architect to execute the full software development life cycle (SDLC) with the DevOps best practice in the Scrum process. Use machine learning and advanced statistics to help build innovative solutions for real-life customer and busi ness problems  • Developing and training machine learning models or deep neural networks for health care solutions by Python or R • Transform data into meaningful conclusions and recommendations Validate the scientific methodology and project outputs of the oth er team members Major Deliverables: Transform marketing data into meaningful business conclusions and recommendations, which included in the monthly data analysis and insight repor t • Work with our Data Scientist to create machine learning models and apply the models in SmartAge and Angel Eyes elderly services • Provide the data architecture in the Digital Healthcare Data Marketplace project, and support the solution architect to build th e data exchange solution  • Support building the product demo and presenting the demo to the investors/funders  ",
        "email": "smartage@smart-age.net",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Scientist AI at SmartAge Intelligence Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to SmartAge Intelligence Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Spark of Anything Limited",
        "job_position": "Summer Data & UX Analyst",
        "job_description": "Job Description :\n Prepare UX/UI design and materials using design software and technologies \ne.g. Figma, Sketch, Photoshop) for websites and mobile apps\n Analyze current user journey to understand motivation, pain points, and \nimprovement opportunities\n Conduct user research, testing, and project evaluation to optimize customer \nexperience Maintain website and app layouts\n Collaborate effectively with technology teams and business stakeholders\n Report to the Senior UI/UX Designer\n\nJob Requirements:\n relevan t experience or strong interest as a UX/UI designer or in similar roles\n Able to handle a Mac and design software and technologies e.g. Figma, \nSketch, Adobe Creative Suite)\n Solid experience in web design with knowledge of interface design, HTML5, \nCSS, SA SS, etc. Creative, well-organized, independent, self-initiated, and \nh ave a strong sense of responsibility Immediate availability is preferred",
        "email": "andrewtsang@sparkofanything.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Summer Data & UX Analyst at Spark of Anything Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Spark of Anything Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Career Hackers",
        "job_position": "Full Stack GenAI Software Developer",
        "job_description": "As a software intern you will be assigned to work on of the following areas: \nAWS Amplify Serverless Development  \nYou will learn how to ReactJS/ CSS (Web Frontend) and AWS Amplify serverless framework to improve user experience within the career simulation portal.  \nYou will use AWS cloud products like Cognito, DynamoDB, Aurora, SES, S3, \nCloudfront, Lambda etc.  \nYou will work closely with Product and Design to build, test and deploy new features. \nWebGL 3D Development (ThreeJS)  \nYou will learn how to develop a gamified recruitment experience using WebGL \nwebsites.  \nYou will use the 3D Software Blender to develop 3D Models.  \nYou will work multiple visual aspects of a gamified simulation: cameras, \ngeometries, user interactions, lights and shadows and shaders etc. \nNodeJS Server Development  \nYou will learn how to real -time communication functionality using WebSockets.  \nYou will also integrate MongoDB, a NoSQL database solution, into server -side \napplications. \nLarge Language Model Development  \nYou will learn SOTA prompting techniques such as CoT, TOT prompting.  \nYou will also develop and refine pretrained large language models. This includes \nexploring new architectures, experimenting with different training approaches, \nand implementing novel techniques to improve model performance.  \nWebRTC VoIP Technology (for virtual commun ication)  \nYou will develop and maintain a real-time communication software using \nWebRTC VoIP Technology.  \nYou will maintain a TURN server in EC2.  \nYou will implement peer -to-peer communication in the frontend using ReactJS/ \nJavascript.  \nJob Requirements \n• No working experience is required but need to demonstrate strong \nprogramming capabilities through projects and awards.  \n• Knowledge in HTML, CSS, Javascript (ReactJS)  \n• Familiar with AWS console environment  \n• Familiar with UX/UI Design  \n• Fast Learner - you will be constantly learning new frameworks and languages  \n• Great problem solver – you will encounter challenges when using new \ntechnologies  \n• A can-do attitude and diligence  \n• Good communication skill  \n• Major in STEM -related  \n• Experience in competitive programming is a plus",
        "email": "justin.tang@careerhackers.io",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Full Stack GenAI Software Developer at Career Hackers. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Career Hackers. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Spendsy Limited",
        "job_position": "AI Developer",
        "job_description": "Research LLM models, design a genAI recommendation system, and integrate it with the existing application. They will demonstrate the system's functionality and provide documentation for implementation and future enhancements.  Job Requirements a. Experience with machine learning/GenAI technology and development b. Basic knowledge LLM (e.g. learning rate, epoch fine-tuning, overfitting adjustment etc) OR; c. Basic GenAI knowledge (e.g. model decision, prompt design, agent implementation) d. Strong programming and problem-solving skills",
        "email": "careers@spendsy.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI Developer at Spendsy Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Spendsy Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "STEM Accelerator Limited",
        "job_position": "Summer Intern",
        "job_description": "Support in various software development and STEM -related curriculum development projects, projects include: Robotic applications , Data analytics platform , AI applications , Game development , and Other block -based programming projects What you will experience in RoboCode Academy:  \n• Making yourself a more 'society -ready' for your future career, enhancing your communication skill and efficiency  \n• A great satisfaction for enabling your students to achieve a higher level  \n• Working with a PhD founder, who is a patent inventor, lecturer, seminar speaker as well  \nJob Requirements:   \n• Required Level of Work Experience: None  \n• Basic programming skills (Python and JavaScript preferred, but not a must) are expected for each candidate  \n• Knowledge data science and AI is an advantage (not mandatory)  \n• We expect each of our teammates is a well -organized person  \n• With relevant teaching experience will have a higher priority  \n• Training will be provided  ",
        "email": "jobs@robocodeacademy.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Summer Intern at STEM Accelerator Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to STEM Accelerator Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "STEM Hong Kong Limited",
        "job_position": "STEM Project Assistant",
        "job_description": " \n• Design and execute marketing and promotional campaigns for 3D printing Education\n• Monitor digital marketing campaigns based on goals and KPIs about 3D printing\n• Develop your professional skills to grow both within the company and on your own\n• Work directly with the marketing and sales team to accomplish tasks assigned by senior management\n• Present ideas to the sales and marketing team and other operational areas within the organization to improve sales processes and marketing procedures to ensure we are operating efficiently and effectively\n• Support the marketing team with daily administrative tasks  \n\nJob Requirements\n\n• STEM Knowledge: Familiarity with science, technology, engineering, and math concepts to effectively communicate with technical teams and target audiences.\n• Marketing Skills: Basic understanding of marketing principles, including market research, branding, advertising, social media, and content creation.\n• Analytical Skills: Ability to analyze data using tools like Excel or Google Analytics to measure marketing campaign success.\n• Technical Skills: Familiarity with marketing tools and software, such as CRM systems, marketing automation, graphic design, website analytics, or SEO.",
        "email": "anson@stemhk.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the STEM Project Assistant at STEM Hong Kong Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to STEM Hong Kong Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Storius Limited",
        "job_position": "User Experience Designer Intern",
        "job_description": "User Experience Designer Intern: Help Shape the Future of Storius App by Crafting Exceptional User Experiences  Storius  is searching for a talented and passionate User Experience (UX) Designer Intern to join our team! As a UX Designer Intern, you'll have the opportunity to learn from experienced professionals and play a key role in enhancing the usability and appeal of our  app. If you're eager to make an impact and have a keen eye for design, this is the perfect opportunity for you!\n\n• Collaborate with our product and development teams to create user -centered designs for the Storius app  \n• Assist in researching and understanding  user needs, behaviors, and motivations to inform design decisions  \n• Contribute to the creation of wireframes, mockups, and interactive prototypes to effectively communicate design ideas and concepts  \n• Participate in usability testing, gathering user feedbac k, and using the insights to improve the user experience  \n• Help maintain and evolve our design system, ensuring consistency and  coherence across the app  \n• Stay up -to-date with the latest design trends and best practices, applying your learnings to create inn ovative and delightful user experiences  \n• Work closely with the development team to ensure designs are implemented accurately and effectively  \n\nJob Requirements:  \n\n• A strong interest in user experience design and a desire to learn and grow in the field  \n• Basic understanding of UX design principles, methodologies, and best practices  \n• Familiarity with design tools such as Sketch, Figma, Adobe XD, or similar  \n• Excellent visual, written, and verbal communication skills  \n• Strong attention to detail and a commitme nt to creating high -quality work  \n• Ability to work effectively in a collaborative, fast -paced environment  \n• A proactive and self -motivated mindset, ready to take initiative and contribute to the team's success  \n• Experience with user research, usability testin g, or interaction design is a plus  \n\nJoin our dynamic team at Storius and jumpstart your career as a UX Designer while helping shape the future of our app!",
        "email": "hk.partnerships@storius.app",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the User Experience Designer Intern at Storius Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Storius Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Strong Petrochemical Limited",
        "job_position": "Quantitative Analyst",
        "job_description": "Job Description \n• Perform quantitative analysis in the global commodity futures market. \n• Develop and implement trading algorithms using relevant computer programming \n\nJob Requirements \n• Strong analytical skills and the ability to interpret complex data sets. \n• Excellent communication skills, both verbal and written and the ability to present findings to senior effectively. \n• An understanding of statistical analysis and modeling techniques will be advantage",
        "email": "hr@strongpetrochem.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Quantitative Analyst at Strong Petrochemical Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Strong Petrochemical Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Syngular Technology Limited",
        "job_position": "Software Engineer/ Engineering Trainee",
        "job_description": "Job Description: \nSyngular was born in 2021 to help surgeons visualize mixed reality (MR) replicas of patient medical images during operations. Realizing the impact of the aging population and medical workforce shortfall on the healthcare system, there is a huge market potential to improve surgical performance and efficiency to shorten operating time and reduce revision surgery. Syngular provided a 3D modeling pipeline platform to convert medical scan data into holograms that can be visualized in a headset with ultra-low latency. Live video streaming with immersive remote interaction can also be achieved \nWe are looking for candidates who are capable of creating a wide range of creative content (3D Models / 2D Textures /Animation / Medical Dicom data) and have a keen passion for making the best user experience for HoloLens or other XR headsets. As a software engineer or engineering trainee, you will be involved in many of the key areas of augmented reality development; from building prototyping features, integrating assets through pipeline tools, and creating interactive scenarios that are realistic and optimized for high frame rates and low latency. You’re a team player and experienced in working with other developers, including Engineers and Designers. This is a fast-paced production environment with the top industrial talents as your peers. You should be proactive and independently driven and strive to take your work from inception to launch. Less experienced candidates may start from handling different mini mobile apps or web-based applications.  \nJob Requirements: \n• Integrate assets in Unity game engine without sacrificing artistic vision or exceeding technical limits of minimum specification mobile devices \n• Develop mini mobile app prototype \n• Develop web-based application prototype \n• Monitor and report product development process \n• Follow up with pre and after sales services",
        "email": "lsze@syngular.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Software Engineer/ Engineering Trainee at Syngular Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Syngular Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Taikangnuo Biotechnology Limited",
        "job_position": "Biotechnology Analyst & Project Manager Intern",
        "job_description": "The students will learn how to use AI behavioral analysis platform for animal disease models, including epilepsy, depression, amblyopia, and atopic dermatitis. The platform covers mice, pigs, dogs, and nonhuman primates. They will learn from different projects.\n\nJob Requirements:\n• At least undergraduate students.\n• Chances for different backgrounds.\n• Prefer students with bio or CS related experience.\n• Familiar with MS apps and some basic data analysis methods.",
        "email": "junqisu2-c@my.cityu.edu.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Biotechnology Analyst & Project Manager Intern at Taikangnuo Biotechnology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Taikangnuo Biotechnology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "TeenShare Limited",
        "job_position": "Marketing data analyst",
        "job_description": "• Assist in planning and executing data -driven marketing and communication activities to support brand development and meet the needs of TeenShare. This includes leveraging analytics tools to gather insights and inform campaign strategies.\n• Provide support in  managing and optimizing digital channels, including websites, mobile apps, and social media platforms, to effectively engage TeenShare's target audience. This involves analyzing user behavior data and making data -backed recommendations \n• Collaborate with ot her departments to create innovative, technology -enabled marketing and communication materials for TeenShare, such as interactive digital brochures, AR -powered product catalogues, or data visualization -driven press releases. This includes ideating, prototy ping, and testing new digital content formats.\n• Provide technical and analytical support to the team, automating repetitive tasks and building custom data dashboards to ensure smooth operations and data-informed decision -making.  \n• Coordinate with the team on the design, development, and data -driven optimization of TeenShare's packaging materials, ensuring a consistent and appealing visual identity across both physical and digital touchpoints. \n",
        "email": "Contact@teensharehk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Marketing data analyst at TeenShare Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to TeenShare Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Tiray Technology (Hong Kong) Co., Limited",
        "job_position": "Web Developer",
        "job_description": "• Contribute to the development of web applications utilizing Node.js and React.js on cloud platforms.\n• Engage in the monitoring, performance tuning, and troubleshooting of web application projects to ensure optimal functionality and user experience.\n• Collect and analyze user requirements to prepare comprehensive specifications and documentation.\n• Collaborate with cross -functional teams, including designers, product managers, and other developers, to deliver high -quality software solutions.\n• Write clean, maintainable, and efficient code following best practices and coding standards.\n• Conduct code reviews to ensure code quality and share knowledge with team members.\n\nJob Requirements:\n\n• Proficiency in JavaScript and/or TypeScript.\n• Demonstrated experience with key web technologies, including React.js, HTML, JavaScript, CSS, jQuery, and Bootstrap.\n• Preferable exposure to public cloud platforms (e.g., AWS) and container technologies (e.g., Docker).\n• Familiarity with version control systems, particularly Git.\n• Ability to work in an Agile/Scrum development environment and participate in sprint planning and retrospectives.\n• Strong problem -solving skills and the ability to debug complex issues.\n• Excellent communication and teamwork skills, with the ability to collaborate effectively with remote teams.",
        "email": "hk-hr@tiray.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Web Developer at Tiray Technology (Hong Kong) Co., Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Tiray Technology (Hong Kong) Co., Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "TradeMonday Limited",
        "job_position": "[STEM Intern] Data Analyst (Power BI, Python)",
        "job_description": "• Participate in BI projects and support the development of dashboards\n• Prepare data collection & cleansing\n• Design & roll out dashboards by using available BI solutions\n• Utilize Power BI capabilities in designing layouts\n• Verify data accuracy\n• Prepare user guide for end user training\n• Debug, monitor and troubleshoot BI dashboards and produce periodical \nupdates\n• Support continuous improvement of dashboards based on latest industry trends \nand standards\n• Provide efficient solutions in handling data\n• Implement analytical thinking for translating data into informative visuals and \nreports\n• Handle problem -solving exercis es by Excel & other BI tools\n",
        "email": "alvin@trademonday.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the [STEM Intern] Data Analyst (Power BI, Python) at TradeMonday Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to TradeMonday Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Trillion AI Company Limited",
        "job_position": "App Developer (Narrative App)",
        "job_description": "• We are seeking a talented and innovative App Developer with a strong passion for storytelling and expertise in mobile application development. \n In this role, you will be responsible for designing, coding, and implementing captivating narrative -driven experiences into our mobile apps.  \n You will collaborate with cross -functional teams to integrate engaging storylines, interactive elements, and user -friendly interfaces.  \n Additionally, you will stay updated on emerging technologies and industry trends, leveraging cutting -edge tools and frameworks to enhance the app's performance, usability, and overall user experience.  \n Your technical proficiency, crea tivity, and storytelling skills will contribute to delivering immersive and captivating narrative app experiences to our users. \n\nJob Requirements: \n\n• Bachelor's degree in Computer Science, Software Engineering, or a related field. Proven experience in mobile  app development, with a strong portfolio showcasing narrative -driven app projects.  \n• Proficiency in programming languages such as Java, Swift, or Kotlin.  \n• Deep understanding of mobile app development frameworks and platforms (iOS, Android).  \n• Strong knowledge of UX/UI principles and best practices.  \n• Familiarity with storytelling techniques and experience in integrating narratives into app interfaces.  \n• Excellent problem -solving and debugging skills.  \n• Ability to work collaboratively in cross -functional teams and communicate effectively.  \n• Strong attention to detail and ability to meet project deadlines.  \n• Stay updated on emerging technologies and industry trends related to mobile app development and storytelling.",
        "email": "contact@zoomob.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the App Developer (Narrative App) at Trillion AI Company Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Trillion AI Company Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "UDS Data Systems Limited",
        "job_position": "Software Developer (Internship Placement)",
        "job_description": "Job Description:\nMy company is going to hire a Software developer to develop software systems based on project requirement. Your duties will involve around building software by writing code, integrate workflow tools, as well as modifying software to fix errors, adapt it to new hardware, improve its performance, or upgrade interfaces. You will also participate in various technical tasks including solution design, proposal preparation, presentation, demonstration, software installation and integration, drafting technical documentation\n\nResponsibilities and Duties :\n• Develop software systems and Workflow based on project requirements.\n• Integrate different (or customise) software systems\n• Participate in various technical tasks including solution design, proposal preparation, presentation, demonstration, software installation and integration, etc.\n• Draft technical documentation\n\nJob Requirements:\n\n• Have software development experience/knowledge in C/C++/JAVA/PHP or scripting (Python, Powershell)\n• Knowledge in networking, OS systems (Windows, Linux, Unix), storage, VM will be added advantages.\n• The desire to work in fast -paced environment.\n• Confident in communicating with people.\n• Good team player but able to work on own initiative and independently\n• Have logically thinking and analytical capability to solve the technical challenges\n• Enthusiastic and highly self -motivated to acquire new knowledge on product and IT industry\n• Self-motivated to complete the job tasks\n• Able to work under pressure to meet the project schedule\n• Proficient in English and Cantonese",
        "email": "frankie@udshk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Software Developer (Internship Placement) at UDS Data Systems Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to UDS Data Systems Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Unicorn Creative Limited",
        "job_position": "Software Developer Intern",
        "job_description": "Collaborate with the development team to design, develop, and implement software solutions.  Assist in coding, testing, debugging, and documenting software applications under the guidance of senior developers. Participate in software design meetings and contribute ideas for improving existing applications or developing new ones. Learn and apply software development best practices and coding standards. Assist in troubleshooting and resolving software defects or performance issues. Stay updated with the latest software development technologies, tools, and trends. \n\nJob Requirements: \nCurrently pursuing a degree in Computer Science, Software Engineering, or a related field.  Proficiency in at least one programming language (such as Java, Python, C++, etc.). Familiarity with software development methodologies (e.g., Agile, Scrum) and version control systems (e.g., Git). Strong problem-solving skills and attention to detail. Ability to work both independently and collaboratively in a team environment. Excellent communication skills and willingness to learn.",
        "email": "hr@unicorncreative.io",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Software Developer Intern at Unicorn Creative Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Unicorn Creative Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "VISUTECH ASIA LIMITED",
        "job_position": "Mobile App Developer",
        "job_description": "• Flutter and Android App development\n• Code review and system design documentation\n• Follow requirements from UI Design\n• Week: Monday – Friday\n• Time: 11:00 am – 7:00 pm\n• Appointment Period: Jun 2024 to August 2024\n\nJob Requirements:\n\n• Personal commitment to quality, attention to detail\n• Effective, articulate design communication and decision -making skills\n• Basic understanding in Progressive WebApp\n• Experience of using Firebase is a plus\n• Basic scripting including Java, Javascript, Dart, Knowledgeable and \nexperienced in IoT system is helpf ul\n• Maximize software performance by monitoring performance, troubleshooting \np problems and outages",
        "email": "info@visutech.asia",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Mobile App Developer at VISUTECH ASIA LIMITED. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to VISUTECH ASIA LIMITED. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "ZETA MOTION LIMITED",
        "job_position": "Internship for Computer Vision and Graphics & Deep Learning",
        "job_description": "• Assist and conduct research activities with our postdoctoral researchers for AI  and Machine Learning technology\n• Assist our software engineer for developing our product inspection solution.\n\nJob Requirements:\n• Interest in computer vision, computer graphics , and deep learning.\n• Experience with image processing and computer vision techniques such as \ndenoising, object recognition, object detection and segmentation, 3D \nreconstruction.\n• Experience with Python.\n• Experience with OpenCV and deep learning frameworks such as Tensorflow or \nPytorch.\n• Working knowledge of linear algebra, calculus, statistics, and 3D geometry.\n• Bonus Requirements: Experiences with C++ (14, 17)",
        "email": "kyle@zetamotion.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Internship for Computer Vision and Graphics & Deep Learning at ZETA MOTION LIMITED. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to ZETA MOTION LIMITED. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    }
]