[
    {
        "company_name": "EM Company",
        "job_position": "Data Analysis",
        "job_description": "• Experience as Data Analyst in Financial Service Industry/Banking Industry\nor contruction\n• Strong experience in requirements engineering. Able to perform user story \npreparation, determine workflow, and give recommendations on process \nenhancements and system upgrades.\n• Proven knowledge and experience with Agile methodologies including \nSAFe, Kanban and Scrum as well as traditional waterfall methodologies \n\nJob Requirements:\n\n• Familiarity with Java\n• Excellent analytical and problem -solving skills with technical \nunderstanding\n• Solid business analysis skills to elicit and document requirement\n• Solid communication skills to liaise with the business stakeholder and the \ntechnical team\n• Clear understanding of software development cycle",
        "email": "efcompany733@gmail.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Analysis at EM Company. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to EM Company. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "eWalker Consulting (HK) Limited",
        "job_position": "IT Security Specialist Trainee",
        "job_description": "Job Description:\n\n• Support IT Security Assessor in performing and documenting CyberSecurity assessment results;\n• Extract IT Compliance requirement (e.g. ISO 27001, ITIL, Cobit ); Document IT\n• Perform security vulnerability assessment and web application scanning services\n• Conduct web and mobile penetration tests \n• Security, IT Audit and Forensics investigation checklists; Prepare training materials\n• Conduct Web 3.0 and Smart contract security review\n• Conduct cloud computing security configuration review.\n\nJob Requirements:\n\n• IT Security/ IT Audit knowledge;\n• IT system administration knowledge will be a plus\n• Previous experience in digital forensics too ls development will be a plus",
        "email": "recruit@ewalker.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the IT Security Specialist Trainee at eWalker Consulting (HK) Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to eWalker Consulting (HK) Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Excalibur Energy Service Company Limited",
        "job_position": "System Developer Intern",
        "job_description": "Job Description \n• Support development of web applications \n• Troubleshoot development problems\nJob Requirements \n• Undergraduate or Postgraduate students whose major is Computer Science, Information Security, Computing, or related disciplines \n• Familiar with the following languages/frameworks, possessing of previous project experience would be a plus, \no JavaScript \no CSS \n o HTML \n o PHP \n • Basic knowledge of IoT and cloud \n• Knowledge of relational database design, e.g. SQL \n• Knowledge on cyber security preferred, especially with web-based contents \n• Knowledge on SDGs / ESG / Carbon Auditing / Green Finance would be an advantage \n• Strong analytical and problem-solving skills \n• Proactive and responsible \n• Good command of spoken and written in English and Cantonese",
        "email": "queenie.uy.tse@excaliburesco.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the System Developer Intern at Excalibur Energy Service Company Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Excalibur Energy Service Company Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Exmersive. AI Limited",
        "job_position": "Immersive Simulation with Generative AI Content Designer",
        "job_description": "Job Description \n• STEM 3D Immersive Simulation with Generative AI Content Builder Learning System \n• Curate and build STEAM business and teaching and learning content. \n• Connect Google docs for easy user adaptation. \n• Test simulation content for business value. \n• Assess the value of immersive learning using Linger, W (2002, 2016) findings. All in our 3D immersive Learning System on an immersive 3D Platform.  \nJob Requirements \nPC or MAC and 2 button-wheel mouse with 20G storage on HDD. Other than having their own computers, we will provide all other hard and software tools the interns will need to do their work. Because the interns will be using Generative AI and a game engine, they have most always wanted to keep the projects they worked on during the internship.",
        "email": "info@exmersive.ai",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Immersive Simulation with Generative AI Content Designer at Exmersive. AI Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Exmersive. AI Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Expando World Limited",
        "job_position": "Data Intelligence Manager",
        "job_description": "Expando is seeking a Data Intelligence Manager intern to join its dynamic team. This role is pivotal in building a comprehensive database of resellers, integrators, and distributors in t he APAC region. The primary focus will be on designing and implementing innovative data collection methods to gather valuable insights and information crucial for Expando's growth and expansion.  \n\nRole and Responsibilities  \n• Design and implement cutting -edge data collection strategies to gather information on resellers, integrators, and distributors in APAC.  \n• Build and maintain a large database of key industry players to support Expando's B2B SaaS partner discovery platform.  \n• Analyze data to extract meaningful insights and trends that can drive strategic decision -making.  \n• Collaborate with cross -functional teams to ensure seamless integration of data intelligence into Expando's operations.  \n• Stay updated on industry trends and best practices in data collection and analysis to continuously improve processes.  \n\nJob Requirements  \n• Enrolled in a relevant field of study such as Data Science, Business Analytics, or related disciplines.  \n• Strong analytical skills with a passion for working w ith data and deriving insights.  \n• Excellent communication and collaboration abilities to work effectively in a team environment. Tech -savvy with knowledge of data collection tools and techniques.  \n• Proactive mindset with a strong willingness to learn and adapt in a fast -paced startup environment.",
        "email": "careers@expando.world",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Intelligence Manager at Expando World Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Expando World Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "FANTASY EDUCATION",
        "job_position": "STEM Materials Developer (Unity)",
        "job_description": "(Position 1)   Position 1: STEM Materials Developer (Unity)\n\nJob Description:\n\n• Develop materials for teaching unity (e.G. Power points)\n• Participate in 3d/2d modeling for unity\n• C# programming\n• Participate in unity game development for stem education towards secondary \nschool students\n\n Job Requirements:\n\n• C# programming experience\n• 3D/2D modeling experience (e.G. Maya)\n• Interest in unity\n• Work individually\n\nNo. of vacancy(ies): 5",
        "email": "recruit@FantasyHK.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the STEM Materials Developer (Unity) at FANTASY EDUCATION. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to FANTASY EDUCATION. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Find Group Limited",
        "job_position": "Software engineering intern",
        "job_description": "Role and Responsibilities\nDuring your internship, you will be involved in various tasks and responsibilities related, but not limited to:\nPrediction model development\nData analysis\nTask implementation (ad-hoc and queued)\nUser testing\nProject planning and development\n\nThese responsibilities are designed to provide you with a comprehensive understanding of our business, enhance your skills, and contribute to the overall goals of our company.\n\nJob Requirements\n• Enrolled in or recently graduated with a bachelor's or master's degree in CityU.\n• Available for an internship lasting for 1 month minimum. (summer cohort)\n• Ability to understand and apply software development concepts. We're looking for the kind of understanding that makes you a tech whiz.\n• Must be responsible, proactive, detail-focused and curious. We're all about delivering the best, just like our app.",
        "email": "tilen.pigac@findgroup.live",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Software engineering intern at Find Group Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Find Group Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "FutureNow Data Technology Limited",
        "job_position": "Growth Engineer",
        "job_description": "Are you ready to skyrocket a tech company's growth trajectory? FutureNow is seeking a dynamic Growth Engineer Intern with a flair for digital marketing and sharp data analysis skills. This STEM internship offers hands-on experience in optimizing our digital presence and leveraging data-driven strategies to propel our brand forward.\n\nWhat You’ll Do:\n• Implement and optimize digital marketing campaigns across multiple platforms.\n• Analyze data to identify trends and insights that drive strategic decisions.\n• Collaborate with cross-functional teams to engineer growth hacks and innovative solutions.\n\nWho You Are:\n• A university student or recent graduate in a STEM field.\n• Passionate about digital marketing, data analytics, and technology.\n• Creative thinker with a problem-solving mindset.\n• Eager to learn and apply new technologies in real-world scenarios.\n\nWhat We Offer:\n• A vibrant, supportive environment where innovation thrives.\n• Opportunities to work on projects that impact our global footprint.\n• Mentorship from industry leaders and access to state-of-the-art tools.\n• Step into the future with FutureNow and transform how growth is engineered.\n• Apply today to be at the forefront of industry innovation!",
        "email": "raymondyeung@futurenow.app",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Growth Engineer at FutureNow Data Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to FutureNow Data Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "GABES Limited",
        "job_position": "Mobile Application Developer",
        "job_description": "As a Front -end Development Intern specialising in React Native, you will have a pivotal role in designing, implementing, and maintaining our real -time system monitoring platform for tablets. This internship pro vides a valuable opportunity to apply your academic knowledge in front -end development within a real-world, fast -paced environment. You will gain hands-on experience with the latest safety and tech innovations while primarily focusing on building robust an d intuitive user interfaces using React Native. \nJob Requirements:   \n• Currently pursuing a Bachelor's degree in Computer Science or a related field.  \n• Proficiency in front -end development using React Native is a must.  \n• Experience working with version control tools, such as Git.  \n• Knowledge of backend technologies and experience in server -side development.  \n• Familiarity with database systems such as MySQL, MongoDB, or similar.  \n• Strong problem -solving abilities and attention  to detail.  \n• Effective verbal and written communication skills.  \nPreferred Qualifications:  \n• Knowledge of IoT integrations and real -time data processing.  \n• Familiarity with version control tools, such as Git.  ",
        "email": "enquiries@gabes.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Mobile Application Developer at GABES Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to GABES Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "GO VR Immersive Limited",
        "job_position": "AI Programmer",
        "job_description": "As a programmer working with our company's partners who specialize in AI solutions for schools, your primary responsibilities would include:  Collaborating with the partners to identify the technical requirements of the schools and their stakeholders.  Designing and developing software solutions that integrate AI technologies to improve the educational experience for students and teachers.  Impl ementing and testing the software solutions to ensure they meet the technical specifications and quality standards.  Providing technical support and troubleshooting when necessary.  Keeping up -to-date with the latest trends and advancements in AI technologies and their applications in the education sector.  Communicating effectively with the partners and other team members to ensure smooth collaboration and project delivery.",
        "email": "info@ufo.school",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI Programmer at GO VR Immersive Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to GO VR Immersive Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Good Chain and Sustainable Supplies Limited",
        "job_position": "Flutter Mobile developer",
        "job_description": "{\n• Assist the daily operation of Plant care work, IoT irrigation system checking,\nEducation service\n• Benchmark and present commonly available Flutter templates and modules\ncovering the user stories identified by business consultants\n• Set up and document Flutter development environment and progress for fast\niteration with colleagues on UI/UX and features\n• Clarify requirements when needed from tools and calculators prepared by\nconsultants (Excel, VBA, Python, Alteryx) to convert or integ rate them into the\napp\n• Demo protoypes internally and take into account feedback provided by\nconsultants.\n}\nJob Requirements: \n• Qualifications From year 2 of BS in Computer Science or equivalent.\n• Diploma and Advanced diploma student with related experience are welcome\nEnglish is our working language\n• Technologies Flutter and/or React Native Experience in Python or Typescript\nan advantage",
        "email": "talent@good -chain.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Flutter Mobile developer at Good Chain and Sustainable Supplies Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Good Chain and Sustainable Supplies Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Greater Bay Biotechnology Limited",
        "job_position": "Cryogenic Engineering intern",
        "job_description": "Research and development of cryogenic medical device and related equipment.\n\nJob Requirements:\n\n• Energy and power engineering, Electrical and Electronic engineering, Material engineering, Mechanical engineering or related discipline.\n• Relevant experience in various refrigeration and freezing technologies, energy consumption, etc\n• Experi ence in cryogenic projects is preferred\n• Proficiency in Chinese and English",
        "email": "hr@greaterbay-biotech.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Cryogenic Engineering intern at Greater Bay Biotechnology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Greater Bay Biotechnology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Green Dynamics Limited",
        "job_position": "AI researcher",
        "job_description": "develop AI algorithm for material discovery, including  1) machine learning models  2) large language models  3) knowledge graph  4) text embedding/graph embeddings\nJob Requirements: good python coding ability, machine learning knowledge, pytorch/tensorflow deep learning framework, be familiar with linux and GPU have knowledge of materials science will be better",
        "email": "hr@greendynamics.com.au",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI researcher at Green Dynamics Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Green Dynamics Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Halo Bridal & Photography",
        "job_position": "Software Engineer",
        "job_description": "As a summer intern at Halo Bridal, you will play a pivotal role in building our online shop and integrating an e-payment gateway. \n• Design and develop the online shop platform, ensuring an intuitive user experience and seamless navigation.  \n• Implement secure e-payment gateway functionality to facilitate online transactions.\n• Collaborate with cross-functional teams to integrate inventory management and order processing systems.\n• Conduct testing and debugging to ensure the reliability and performance of the online shop.\n• Provide ongoing support and maintenance to optimize the platform for scalability and efficiency.  ",
        "email": "talents@halo-bridal.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Software Engineer at Halo Bridal & Photography. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Halo Bridal & Photography. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "HANINK INNOVATION LIMITED",
        "job_position": "Prompt Engineer Intern",
        "job_description": "As a Prompt Engineer intern, you will play a crucial role in shaping the dialogue  between humans and AI. You will be responsible for crafting and optimizing prompts that guide our AI systems to generate accurate, relevant, and engaging responses. This  role is perfect for individuals who excel in linguistic skills an d are fascinated by the  intersection of language and technology.  \nWhat You’ll Gain:\n•⁠A dynamic and innovative work environment with leading AI experts.\n• Hands -on experience in cutting -edge AI technologies and projects.\n• Opportunities for personal and profess ional growth.\n• A supportive and collaborative team culture.\n• Competitive internship stipend and flexible working hours.\n\nJob Requirements : \n• Develop and refine prompts to effectively interact with AI models in both  English and Chinese.  \n• Collaborate with cross -functional teams to understand project requirements and  contribute to the development of AI -driven solutions. \n• Analyze and assess the performance of AI -generated content, providing  insights and recommendations for improvement. \n• Participate in brain storming sessions to explore new ways to enhance user interaction with AI systems.",
        "email": "hanink@hanink.my.id",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Prompt Engineer Intern at HANINK INNOVATION LIMITED. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to HANINK INNOVATION LIMITED. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Homie Living Limited",
        "job_position": "E-commerce Operations and Digital Marketing Intern",
        "job_description": "• Build and grow efficient processes for ensuring ecommerce fulfillment\n• Manage product data and information to fuel the fast growing SKU number on the ecommerce platform\n• Data analytics on product trends and convey new findings to the team\n• Data analytics of the online platform to map consumer decision journey and optimise ecommerce online journey and experience\n• Ensure superior customer experience from order placement to fulfillment\n• Plan and execute data driven digital marketing, including SEO/SEM on-platform and off-platform, social media, influencers, video, display and programmatic campaigns\n• Measure and report performance of all digital marketing campaigns data , and assess against goals (ROI and KPIs) to idenitfy insights\n• Identify trends and insights, and optimize ad spend and performance based on the insight\n",
        "email": "career@homiehk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the E-commerce Operations and Digital Marketing Intern at Homie Living Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Homie Living Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "ideabee Design Consultancy Limited",
        "job_position": "Automation / IT Intern",
        "job_description": "Job Description:\n• Set up and maintain automation workflows using various tools.\n• Correspond with potential clients regarding automation -related queries.\n• Reach out to clients to provide consultancy on automation solutions and their \nbenefits.\n• Be involved in all elements of the business, providing a chance to understand \nand contribute t o various aspects.\n\nJob Requirements:\n• Currently studying in an IT -related field or any other STEM field.\n• Proficiency in English.\n• Willing to learn and grow on their own.\n• Comfortable with uncertainty and ambiguity, and open to exploring solutions \nindependently.\n• Willingness to work on tasks outside of their major if they are important for the \nbusiness.",
        "email": "Tayseer@ideabeeDesign.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Automation / IT Intern at ideabee Design Consultancy Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to ideabee Design Consultancy Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Igears Technology Limited",
        "job_position": "Intern -Programmer",
        "job_description": "Responsibilities:\n• Responsible for system design, development, testing and analysis of applications and websites\n• Collect user requirements and perform technical analysis\n• System Design and specification writing\n• Implement and maintain systems and websites\n• Test on different browsers\n• Communicate with managements and teams to achieve company goals and targets.\n\nJob Requirement:\n• Diploma or above in Computer Science or related disciplines.\n• Proficient in PHP, HTML, HTML5, CSS, JavaScript, SQL is required.\n• Experience in open source CMS platforms such as Word Press, Joomla, Drupal or Magento is an advantage.\n• Experience in development on mobile platforms is an advantage.\n• Experience in Websphere, C# is an advantage\n• Interest and Actively research on new web technologies.",
        "email": "hr@igears.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Intern -Programmer at Igears Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Igears Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Infinity Lab R&D Limited",
        "job_position": "React Developer",
        "job_description": "We are looking for an intern to join our team as a React Developer. In this role, you will be responsible for creating a system that generates reports using data stored in a DynamoDB database. Your main tasks will involve designing and developing a user -friendly solution that efficiently generates reports, ensuring a seamless experience for our users.  \nResponsibilities:  \n• Develop a React -based application for generating analytics reports.\n• Integrate the application with AWS DynamoDB to retrieve the required d ata for report generation.\n• Implement suitable PDF generation libraries or APIs for React applications.\n• Collaborate with UI/UX designers to translate visual designs into functional web experiences.\n• Optimize the application for maximum performance and scalability.\n• Ensure data security and privacy in the PDF generation and data handling processes.   \n• Participate in code reviews and project planning sessions.\nJob Requirements:  \n• Demonstrated experience in React development and working with state management libraries.\n• Strong understanding of AWS services, particularly DynamoDB.\n• Experience with PDF generation libraries in a React environment. - Proficiency in HTML, CSS, and JavaScript.\n• Familiarity with RESTful APIs and asynchronous request handling.\n• Excellen t problem -solving skills and meticulous attention to detail.",
        "email": "info@infinitylab.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the React Developer at Infinity Lab R&D Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Infinity Lab R&D Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Inspectrum Company Limited",
        "job_position": "IT Internship Program",
        "job_description": "IT business IS NOT just IT. You need to have a broad knowledge of the operations of the business world so that you can advance your future career. We see a lot of programmers who cannot move up the corporate ladder because they know very little about the b usiness world practices. In this program, you may need to:  \nAssist in IT infrastructure projects, including Data Analysis and System \nConfiguration  \nAssist in IT operation (e.g. front -end and back -end design/implantation) - \nParticipate in function testing wi th test cases  \nParticipate in UAT Testing \n\nJob Requirements : \nWe expect you should possess the following personal qualities and experience: \n• University students majoring in Computer Science, Systems Engineering or \nother STEM related disciplines  \n• Passionate about developing a career in the Information Technology related \nindustry - Highly proactive and outgoing  \n• Independent with strong self -initiative  \n• Strong motive to learn  \n• Good communication skill with department heads and consultants  \n• Proficient in  Chinese and English",
        "email": "andy.chan@inspectrum.io",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the IT Internship Program at Inspectrum Company Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Inspectrum Company Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "InspireLab Limited",
        "job_position": "Summer Internship",
        "job_description": "Job Description \n• Assist in conducting research and literature reviews in the designated STEM area.\n• Collaborate with the development team to develop and implement new technologies and develop STEM curriculums with teaching materials.\n• Collect and analyze data, and assist in interpreting and summarizing research findings.\n• Design and conduct experiments, and assist in troubleshooting and resolving technical issues.\n• Participate in team meetings and contribute ideas and suggestions for project improvement.\n• Collaborate and help in organizing STEM events and lessons.\nJob Requirements\nAny discipline related to STEM - Bachelor; Master - Year 1 - Final Year\nInternship Period: Summer Term 2024 \nFull-time placements with a duration of no less than 4 consecutive weeks (28 calendar days)",
        "email": "info@inspirelab.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Summer Internship at InspireLab Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to InspireLab Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "iSEE Mobile Limited",
        "job_position": "STEM Engineer",
        "job_description": "Job Description :  \n Familiar with AI tools, such as ChatGPT  \n Interested to apply emerging technologies to empower people with \ndisabilities  \n Conduct R&D work on STEM education (Machine learning, Computer \nVision, ChatGPT)  \n Develop STEM course curriculum  \n Prepare prototype of STEM course  \n\nJob Requirements :  \n Experience in using AI tool  \n Teaching experience",
        "email": "info@iseemobile.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the STEM Engineer at iSEE Mobile Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to iSEE Mobile Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "iTunel Technology Limited",
        "job_position": "Position 3: Associate Product Manager Intern - AI",
        "job_description": "• Assist in project planning, coordination, and execution, ensuring adherence to  timelines and deliverables\n• Collaborate with cross -functional teams to gather project requirements and  establish project scope\n• Support project documentation, including project plans, status reports, and  meeting minutes\n• Coordinate and track project tasks, ensuring completion and alignment with  project objectives\n• Assist in identifying and managing project risks, proposing mitigation  strategies\n• Facilitate effective communication and collaboration among project  stakeholders\n• Build and maintain positive relationships with project stakeholders, including  clients, team members, and vendors\n• Monitor stakeholder expectations and actively manage stakeholder engagement  throughout the project lifecycle\n• Contribute to continuous process improvement by identifying areas for  optimization\n\nJob Requirements:\n\n• Experience with Agile ceremonies and project management best practices\n• Experience of using AI applications and prompting are preferred\n• Interests and passion in generative AI technologies are highly valued\n• Demonstrated ability to work independently with self-initiative\n• Strong problem -solving skills and ability to think critically\n• Excellent interpersonal skills and ability to build positive relationships with  team members\n• Strong verbal and written communication skills in English and Cantonese, any  other  language is a plus",
        "email": "brian@itunel.io",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Position 3: Associate Product Manager Intern - AI at iTunel Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to iTunel Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Jobutify Limited",
        "job_position": "AI Engineer",
        "job_description": "As a STEM Internship AI Engineer at Jobutify , you will have the exciting opportunity to contribute to cutting -edge projects aimed at enhancing our platform's capabilities. Your primary responsibility will be to develop an OpenAI LangChain supported by advanced prompts. Additionally, you will collabo rate on building models capable of predicting salaries using various available methodologies. This role offers hands -on experience in AI engineering, research, and model development, providing a unique opportunity to make meaningful contributions to the fu ture of job applications. Join us at Jobutify and embark on a journey to revolutionize the job application process while gaining invaluable experience in the field of AI engineering. Apply now to be part of our dynamic team!  Job Requirements: • Proficiency in Python and JavaScript programming languages • Ability to work independently, conduct research, and implement new features  • Familiarity with OpenAI API and LangChain Experience in prompt engineering and machine learning for prediction tasks  • Strong commun ication skills, with English as the medium of instruction  • Eagerness to learn and adapt to new technologies and methodologies",
        "email": "talantbekzhenishbekuulu@jobutify.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI Engineer at Jobutify Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Jobutify Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Kanaya AI Technology Limited",
        "job_position": "Hydroponic Interns",
        "job_description": "Job Description:\n• Assist the daily operation of Plant care work, IoT irrigation system checking, Education service\nJob Requirements:   \n• Undergraduate students with basic knowledge of Plant Science or Data science are preferred",
        "email": "sunny@kanaya.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Hydroponic Interns at Kanaya AI Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Kanaya AI Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Kezz Consulting Company Limited",
        "job_position": "Digital Marketing Intern",
        "job_description": "We are offering a 2 -month internship opportunity for an enthusiastic individual to join our team as Digital Marketing Intern. In this role, you will have the exciting opportunity to utilize the latest AI tools and technologies to create captivating and engaging animated videos for digital marketing / content marketing purpose. If you have a passion for digital marketing, animation, AI, and creativity, this internship will provide you with valuable hands -on experience.\n\n• Collaborate with the team to understand project requirements and objectives.\n• Research and compare various AI tools and techniques for animated video production to enhance our capabilities.\n• Utilize AI tools and software to create high -quality animated videos for digital marketing campaigns.\n• Bring characters and stories to life through creative storytelling and animation techniques, tailored for digital marketing purposes.\n• Edit and refine animations to ensure smooth transitions and appealing visual effects. \n• Incorporate feedback from the tea m to refine and improve animations for optimal digital marketing impact.\n• Work within project timelines and deliver animations according to digital marketing campaign schedules.\n• Collaborate with other team members to ensure seamless integration of animations into digital marketing materials.\n• Maintain organized files and documentation of animation projects for future reference.\n\nBenefits:\n• Hands -on experience using the latest AI tools and technologies in animation for digital marketing purposes.\n• Exposure to  real-world animation projects and workflows within a digital marketing context.\n• Potential for performance -based bonuses during the internship.\n• Possibility of part -time or full-time employment after the internship (based on performance and business needs ).",
        "email": "hr@kezzconsulting.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Digital Marketing Intern at Kezz Consulting Company Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Kezz Consulting Company Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Konew Capital International Limited",
        "job_position": "Intern, Fintech",
        "job_description": "Join us now and be part of our exciting journey! At Konew, we foster a culture of innovation, continuous improvement and collaboration. We strive to develop our talents and provides incumbent with opportunities to be well -equipped for future careers. The i ntern will assist in FinTech department daily operation and software/ system development projects. We support life -long learning to fulfil their personal growth and career aspirations. We are also committed to creating a positive working environment which value a healthy work -life balance.  \n\n• Assist our software development team in building and maintaining software products and systems  \n• Dive into our company's database and help us make sense of the data by organizing and cleaning it up.  \n• You'll get to work with real -world data and help ensure that our systems and products are built on a solid foundation  \n• Conduct research and explore new technologies for process reengineering and office automation  \n• Collaborate with cross -functional teams to identify process inefficiencies and propose solution  \n• Participate in code reviews and contribute to the development of new features and enhancements  \n\nJob Requirements:\n\n(A) Education Background:\n• Undergraduate student\n• Year 2 or above\n\n(B) Discipline Preferred:\n• Computer Science, Information Systems, Data Science or Engineering related disciplines  \n\n(C) Technical Skills:\n• Good in programming\n• Familiar with database concepts and SQL  \n\n(D) Language Proficiency:\n• Good command of written and spoken English and Chinese  \n  \n(E) Others: Independent with logical and analytical thinking\n• Excellent communication and interpersonal skills\n• Quick learner with the ability to adapt to new technologies and tools\n• Self-motivated and able to work independently as well as part of a team  ",
        "email": "fioncheng@konew.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Intern, Fintech at Konew Capital International Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Konew Capital International Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Laire Tech Limited",
        "job_position": "Internship, lab assistance",
        "job_description": "• To collect lab data and market data collection\nJob Requirements: • Science, engineering student",
        "email": "tom.lee35@gmail.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Internship, lab assistance at Laire Tech Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Laire Tech Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "LANGYA AI LIMITED",
        "job_position": "Technology and Process Automation Intern",
        "job_description": "Introduction: Our businesses (e.g. technology/e -commerce, systematic investment, etc) rely extensively on automated processes and third -party software. This internship will help us to enhance our automated processes as well as software deployment.  We are flexible to customise intern's work according to their ability and interest within the following scope:  1)Research and automation , Perform data analysis on different areas ,Automate data collection and/or processes via SFTP, robotic process automation, web scraping, data processing, etc , Conduct research on technology products, services and/or software 2)Others E.g. we are also hirin g Digital Marketing intern separately. Successful candidate may occasionally assist in those tasks Job Requirements: •Proficient with at least one programming language. •Proficient with Matlab and HTML will be a plus.",
        "email": "hr@langyaai.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Technology and Process Automation Intern at LANGYA AI LIMITED. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to LANGYA AI LIMITED. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Learn Smart Education Centre Limited",
        "job_position": "Website & App Development intern",
        "job_description": "• Assist in Website & Application development\n• Optimize the content and technical aspects of the website and app\n• To plan/create/ implement of digital contents to build brand awareness and create purchase desire through digital communications;\n• Other tasks relating to digital marketing\n\nJob Requirements:\n\n• Knowledge of Web & App Technologies\n• Knowledge of digital marketing tools - Knowledge of Adobe Photoshop or Illustrator\n• Attentive to details and well organized\n• Ability to handle multiple ongoing tasks\n• Ability to work with little supervision",
        "email": "info@learnsmarteducation.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Website & App Development intern at Learn Smart Education Centre Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Learn Smart Education Centre Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Lecopt Technology Limited",
        "job_position": "Machine Learning Internship",
        "job_description": " Feature engineering and ML/AI model building  Algorithm research and software development on legal technology  Validation on the performance of the algorithm  Research on machine learning, text recognition and image recognition  Deliver innovative technology  Participating in AI solution design and implementation",
        "email": "admin@lecopt.tech",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Machine Learning Internship at Lecopt Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Lecopt Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "LemonGene Technology Limited",
        "job_position": "AI Programmer(CS Chatbot)",
        "job_description": "Job Description: Are you a university student passionate about AI and eager to apply your programming skills to real -world challenges? LemonGene Technology Limited is looking for a talented AI Programmer Intern to join our team. This internship offers a unique opportunity to work on cutting-edge AI applications aimed at enhancing our customer service capabilities. You'll be involved in developing and implementing AI-powered chatbots to handle basic user queries, reducing human workload and improving efficiency.  \n\nKey Responsibilities: \n• Develop AI Chatbots: Design and implement AI-driven chatbots using Python and other AI tools to address common customer service inquiries.  \n• Integrate AI Solutions: Work with our development team to integrate AI chatbots into our existing customer service platforms.  \n• Test and Optimize: Conduct testing and optimization to ensure the chatbots perform effectively and provide accurate responses.  \n• Collaborative Projects: Collaborate with the customer service and technical teams to identify areas where AI can further enhance customer support.  \n• Ad Hoc Tasks: Assist with other related tasks and projects as assigned.  \n\nJob Requirements:  \n• Basic Programming Skills: Familiarity with Python programming and a keen interest in AI technologies.  \n• Problem -Solving Mindset: Ability to think critically and solve problems effectively.  \n• Willingness to Learn: Eagerness to learn new AI tools and technologies.  \n• Team Player: Strong collaborative skills and the ability to work effectively in a team environment.",
        "email": "jacky_chan@lemongene.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI Programmer(CS Chatbot) at LemonGene Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to LemonGene Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Little Stories & Co",
        "job_position": "UI/ UX Design & Content Strategist Intern (STEM)",
        "job_description": "We are looking for people who can come in to help build our practice, creating user interface and user experience sketches for a growing global client base for  Summer 2024. You’ll shape experiences with our community, and evolve our brand voice. You’ll design user interface, user testing, develop design and content for blogs,  website and social media channels based on interactive design strategies, and develop  our interactive design content standards.  \n• Identify design problems and develop the most efficient solutions with clear understanding of business goals and user behavior  \n• Create flow diagrams/charts, storyboard, infographic and design mock -up using Figma for our website, launching an e -commerce website, social media  channels including Instagram, Facebook, Pinterest and Youtube  \n• Define the content strategy for a project or f eature and write clear and concise content across multiple touchpoints  \n• Share your work, provide and incorporate feedback, and be an active  participant on the team  \n• Advocate for the overall user experience and ensure consistency across  platforms  \n• Support digital marketing, SEO & SEM strategies to support Little Stories’  Marketing Campaign  \n• Facilitate internal and external clients’ product visions by researching,  conceiving, wireframing, sketching, prototyping, and mocking up user  experiences for di gital products  \n• Communicate and engage with Little Stories’ community via various of the  online channel to build a strong client community  \n• Perform ongoing keyword discovery, expansion and optimization  \n• Help people who are audiences and clients of Little S tories feel welcome and  empowered, carefully considering tone and writing content that’s consistent with Little Stories's mission of keeping lifestyle and legacies through art and  photography  \n• Approach all of your work with a global mindset, advocating for  designs and language that internationalize well  ",
        "email": "career@little-stories.co",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the UI/ UX Design & Content Strategist Intern (STEM) at Little Stories & Co. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Little Stories & Co. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Lyfex Technology Limited",
        "job_position": "Business Analyst Intern",
        "job_description": "Join Lyfex as a Business Analyst Intern and embark on an exciting opportunity to apply your analytical skills and contribute to the transformation of the wellness and fitness industry! We are seeking a motivated and detail -oriented individ ual to join our dynamic startup, where you will have the chance to work closely with our experienced team and gain hands -on experience in business analysis and strategy formulation. As a Business Analyst Intern, you will play a crucial role in conducting r esearch, analyzing data, and providing valuable insights to support our business decisions and growth strategies. You will have the opportunity to work on various projects, including market research, competitor analysis, and performance evaluation, while g aining exposure to different aspects of our startup operations.  \n• Conducting research on various business topics, such as overseas expansion, peer comparisons, and investor backgrounds.  \n• Assisting  in data analytics to evaluate business and marketing performance and develop actionable strategies.  \n• Collaborate with cross -functional teams to develop and implement business strategies and action plans.  \n• Support in preparing reports, presentations, and dashboards to communicate findings and recommendations.  \n• Participate in team meetings and brainstorming sessions to contribute innovative ideas and problem -solving solutions.  \n• Providing business and administ rative support to supervisors.  \n\nJob Requirements:  \n• Currently pursuing an undergraduate degree in Business Analytics, Digital Marketing, Creative Media or related fields.  \n• Passionate about technology, wellness, and fitness.  \n• Excellent interpersonal, communic ation, and analytical skills.  \n• Demonstrated self -motivation and eagerness to learn.  \n• Proactive, responsible, and reliable.  \n• Knowledge of data analytics tools (e.g., VBA macro, Power BI, Quick BI) is an advantage  \n• Knowledge of design software (e.g. Illustra tor, Photoshop, etc) is an advantage  ",
        "email": "hr@lyfex.tech",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Business Analyst Intern at Lyfex Technology Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Lyfex Technology Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "m-Chinese Solution Limited",
        "job_position": "Software Engineer Intern",
        "job_description": "Job Description:  \n\nadditional Software Engineer Interns Responsible for the following tasks:  \n Research on AI/ML, mainly focus on OCR/NLP/NLU/NLG.  \n Developing the program/module/library to apply AI/ML in the current  system.  \n Enhance and improve the backend and frontend of web application.  \n Conduct testing on scripts and applications.  \nJob Requirements : \n Currently studying bachelor’s degree in computer science, IT or similar field.  \n Knowledge in TypeScript/Node.js/JavaScript/Python is preferred.  \n Knowledge in Next.js, React or other modern frontend framework would be  an advantage.  \n Knowledge in database is a plus.  \n Able to work independently and with a team.  \n Eager to learn new technology and software development tool.  \n Interested in AI/ML or data analytics.  \n You must be able to read and write in Traditional Chinese as the post holder  may be r equired to carry out research on how AI technologies can be used in  the Chinese Language.",
        "email": "recruitment@mlang.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Software Engineer Intern at m-Chinese Solution Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to m-Chinese Solution Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Merit Asset Management",
        "job_position": "Investment Analyst Assistant",
        "job_description": "Job Description\n1. Investment Assistant Position: Conduct fundamental research and modeling for the company.\n2. Macro-economic Data: Collect, summarize, and analyze macro-economic data.\n  3. Portfolio Backtesting: Calculate and analyze backtesting data for investment portfolios.\n 4. Investment Reporting: Assist researchers in writing investment reports and ensure their regular publication.\n 5. Assist and Supervise External Software Development Companies: Help the company develop investment management and wealth management apps, as well as back-end systems.\n 6. Additional Tasks: Assist the company with other assigned tasks.\n\nJob Requirements\n1. Proficiency in Microsoft Office, Bloomberg or relevant macro-economic database.\n 2.  Strong analytical and quantitative skills.\n 3. Excellent written and verbal communication skills in English.\n 4. Ability to work independently and as part of a team.\n 5. Previous experience in financial math or investment management is a plus.",
        "email": "research@merit-am.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Investment Analyst Assistant at Merit Asset Management. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Merit Asset Management. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Mindplus AI Limited",
        "job_position": "[Summer Internship] AI Engineer",
        "job_description": "Design and develop AI algorithms for analyzing OCT medical images\nCollaborate with other team members to implement and optimize AI models\nConduct experiments and evaluate the performance of AI models\nStay up -to-date with the latest developments in AI and machine learning\n\nJob Requirements\n• Studying Bachelor's degree in Computer Science, Electrical Engineering, or related fields\n• Strong programming skills in Python and experience with AI frameworks such as TensorFlow, Keras, or PyTorch\n• Knowledge of machine learning algorithms, deep learning, and computer vision\n• Experience with cloud computing platforms such as AWS or Azure\n• Excellen t problem -solving skills and ability to work in a team",
        "email": "recruit@mindplusaihk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the [Summer Internship] AI Engineer at Mindplus AI Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Mindplus AI Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Morning Bliss Limited",
        "job_position": "Intern",
        "job_description": "We are inviting students from eligible STEM -related programs to join our team as a full-time intern to gain innovation and technology -related work experience through the STEM Internship Scheme. As an intern, you will have the opportunity to:  \n• Take part in web optimization (e.g. Search Engine Optimization) and enhancement of the e -commerce system  \n• Engage in website design, troubleshooting, logistics and electronic payment arrangements  \n• Involve in data analysis and organization of the database  \n• Participate in design, production and editing of the company videos  \n• Carry out digital marketing campaigns through social media platforms (e.g. Instagram, Facebo ok and YouTube)  \n• Complete other duties as assigned  \n\nJob Requirements : \nWe are seeking suitable candidates who meet the following criteria: \n• Proficiency in written and spoken Chinese and English (Native in Cantonese preferred) \n• Excellent computer skills with experience in developing professional websites and maintaining e -commerce platforms \n• Experience in creating visual content for social media and marketing materials, including familiarity with graphic design and video editing software \n• Effective communication skills, coupled with a strong sense of responsibility  \n• Diligent and dedicated work attitude, with strong attention to detail and the ability to work independently  ",
        "email": "jobs@mbliss.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Intern at Morning Bliss Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Morning Bliss Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Nexuscortex limited",
        "job_position": "Data Analysis",
        "job_description": "We are looking for a Data Analyst (DA)  with strong organizational and planning skills and proven ability to multitask in a fast -paced environment. We are seeking a high  level of motivation and a self -starting attitude, with the ability to collaborate with  product, delivery and engineering team s.\nThe ideal candidate should have experience and be comfortable to work with a diverse multi -cultural remote team.  \n\nJob Requirements:\n• Experience as Data Analyst in Financial Service Industry/Banking Industry or  contruction\n• Strong experience in requirements engineering.\n • Able to perform user story preparation, determine workflow, and give recommendations on process enhancements and system upgrades.\n• Proven knowledge and experience with Agile methodologies including SAFe,  Kanban and scrum as well as traditional waterfall methodologies \n• Familiarity with Java \n• Excellent analytical and problem -solving skills with technical understanding \n• Solid business analysis skills to elicit and document requirement \n• Solid communication skills to liaise with the business stakeholder and the technical team  \n• Clear understanding of software development cycle ",
        "email": "admin.info@nexuscortex.ltd",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Analysis at Nexuscortex limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Nexuscortex limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "NJAC Studio Limited",
        "job_position": "Web Developer",
        "job_description": "As a Web Developer at NJAC Studio, you will be responsible for designing and developing websites of NJAC Studio so that effectively communicate our mission and services to the public.  Role and Responsibilities\n• Collaborate with the design a nd content teams to translate concepts into engaging website designs.\n• Develop responsive and user -friendly websites using HTML, CSS, and JavaScript.\n• Implement website features and functionality to enhance user experience.\n• Conduct testing and debugging to ensure website performance and compatibility across devices and browsers.\n• Stay updated on industry trends and best practices in web development.\n\nJob Requirements\n• Proficiency in HTML, CSS, and JavaScript.\n• Familiarity with front -end frameworks such as Boots trap or React is a plus.\n• Undergraduate from Engineering/Science/Technology Related Field\n• Strong attention to detail and ability to translate design concepts into code.\n• Excellent communication and teamwork skills.\n• Passion for social impact and promoting div ersity and inclusion.",
        "email": "admin@njacstudiohk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Web Developer at NJAC Studio Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to NJAC Studio Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Nut Limited",
        "job_position": "Blockchain Engineer Intern",
        "job_description": "Job Description\n• Developing, maintaining and implementing source code based on requirement\n• Implementing testings and automation to test the application\n• Collaborating with cross-functional teams to develop and implement decentralized solutions\n• Troubleshooting and debugging issues in smart contract, web app, mobile source code\n• Writing and maintaining technical documentation for decentralized applications\n• Continuously improving software development processes\nJob Requirements\n• Experience with Ethereum or other blockchains or any decentralized protocols\n• Understanding of decentralized application architecture like crypto wallet and dApps\n• Familiarity with web3.js, IPFS or similar libraries are preferred\n• Demonstrated ability to work independently with self-initiative\n• Excellent problem-solving skills and can-do mentality\n• Strong verbal and written communication skills in English and Mandarin, any other language is a plus",
        "email": "brian@hashnut.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Blockchain Engineer Intern at Nut Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Nut Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Oxbridge Economics Limited",
        "job_position": "Economic Researcher (STEM Internship Scheme)",
        "job_description": "Job Description: We Are Hiring! Oxbridge Economics is a fintech company dedicated to developing AI-based economic, financial, and policy analysis products and tools. We also provide tailor -made research and consulting services for institutional clients. Our R&D and market teams comprise renowned scientists from top -tier US universities and seasoned professionals with extensive experience and networks in the financial industry. We have offices in Hong Kong, Shenzhen, and Boston; our Hong Kong company is supported by Cyberpor t, HKAI Lab, and the government. Due to business expansion and product development needs, our Hong Kong office is currently seeking Junior Software Engineer Intern to join our dynamic team of young professionals.  Key Responsibilities: Assist senior economi sts and data scientists with regular work, including but not limited to statistical analysis, modeling, literature review, and report writing; Contribute to product development, maintenance, and improvement; Analyze, model, and visualize structured and uns tructured data in a variety of environments;  Support discovery of new analytical techniques and external data to apply to existing statistical models or creation of new insights; Attend client meetings and take notes;  respond to ad -hoc requests from client s and managers. Mandatory Requirements: Undergraduate/post -graduate in computer science, information technology, or related STEM field from Hong Kong universities (final -year students are welcomed as long as you remain a student during your internship);  Working experience and relevant intern or part -time experience; Working knowledge in statistics, econometrics, and the fundamentals of data science; Outstanding programming skills with SQL, R, Python, or other data analysis tools. Fluency in English and Chin ese (Mandarin or Cantonese);  Strong desire and capability to learn new things; Detail -oriented personality and hard -working attitude.  Job Requirements:  • Preferred Qualifications: Proficiency in the use of databases such as Wind, Bloomberg, Capital IQ, etc.;  Knowledge of a professional BI tool such as Power BI, Tableau, Qlikview, etc.;  Experience with data warehousing and building ETL pipelines.",
        "email": "careers@oxbridge-econ.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Economic Researcher (STEM Internship Scheme) at Oxbridge Economics Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Oxbridge Economics Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    }
]