[
    {
        "company_name": "AI Mnemonic Limited",
        "job_position": "Data Analyst",
        "job_description": "• Responsible for analyzing data from our wearable healthtech  devices and developing analytic algorithms.\n• The role will be based in Hong Kong and will involve working closely with our product and software development teams to ensure the timely delivery of high -quality data analysis and algorithms.\n• Self-motivated  and driven individuals who are passionate about computer vision and data science and wearable device development, and are willing to work for a start -up company in a Work-Life balance environment.\n\nJob Requirement:\n• Pursuing or recently completed a degree in Data Science, Computer Science, or related fields.\n• Strong programming skills in Python and experience with data analysis libraries such as NumPy, Pandas, and Matplotlib.\n• Experience with converting Matlab algorithms to Python code.\n• Knowledge of com puter vision and motion data analysis algorithms.\n• Familiarity with machine learning algorithms and techniques",
        "email": "admin@aimnemonic.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Analyst at AI Mnemonic Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to AI Mnemonic Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "AMDC Holding Limited",
        "job_position": "Digital Marketing Executive",
        "job_description": " As a Digital Marketing Associate, you will play a crucial role in our marketing efforts, focusing on planning and designing the project’s social media marketing, SEO research and analysis as well as marketing executions. The role will also be supporting the company’s in -person marketing campaign for clients when and if necessary. This position offers a unique opportunity to gain hands -on experience in the tech aspects of marketing, working closely with our experienced team.  \n\n• Social Media Marketing: Assist in planning, creating, scheduling and analyzing content across various social media platforms to increase engagement and brand awareness; if necessary, running ads on platforms like Instagram, Facebook and LinkedIn  \n• SEO (Sea rch Engine Optimization) Research and Analysis: Conduct keyword research, analyze website traffic, and provide insights to improve our search engine rankings to drive organic traffic  \n• Content Creation: Collaborate with the founders to develop compelling c ontent for social media, email marketing and other digital channels  \n• Data Analysis: Using tools like Google Analytics to track and analyze website traffic, user behavior, and campaign performance  \n• Marketing Automation: Using tools to automate marketing t asks and workflows  \n• Graphic and Video Design: Creating visual content and short videos using Canva and/or Adobe Photoshop or any other similar applications - Market Research: Stay up -to-date with social medica trends and activities to create appealing con tent to improve engagement  \n\nJob Requirements:  \n• Familiarity with social media platforms and a basic understanding of digital marketing tools.  \n• Excellent written and verbal communication skills in both English and Chinese.  \n• Strong analytical mindset with th e ability to interpret data and provide actionable insights.  \n• Self-motivated, detail -oriented, and capable of working independently as well as collaboratively within a team.  \n• A background or experience in design is a plus.",
        "email": "None",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Digital Marketing Executive at AMDC Holding Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to AMDC Holding Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "CHM Company",
        "job_position": "Web Developer",
        "job_description": "• Partner closely with the Project Manager, Business Analysts, and stakeholders to gather, analyze, and comprehend detailed business requirements.\n• Translate complex business needs into effective, user -friendly software solutions by leveraging best practices in soft ware engineering.\n• Write clean, efficient, and well -documented code while adhering to industry standards and the organization's coding guidelines.\n• Conduct thorough unit testing and debugging to ensure high -quality, bug -free software deliverables. Identify a nd resolve complex technical issues by employing innovative problem -solving techniques.\n• Contribute to the continued enhancement and evolution of the organization's software products.\n• Create and maintain comprehensive documentation of software designs, code , and processes to facilitate seamless collaboration and future enhancements.\n\nJob Requirements:\n• Strong proficiency in software development, with hands-on experience in one or more programming languag es (e.g., C#, ASP.NET, JavaScript, TypeScript)\n• Proven experience in MSSQL application development, including database design, optimization, and integration with .NET applications\n• Demonstrated experience in the full software development life cycle (SDLC), including requirements gathering, design, development, testing, and deployment\n• Excellent analytical and problem -solving skills, with the ability to translate complex business requirements into functional software\n• Demonstrated experience in writing clean, ef ficient, and well -documented code\n• Proven track record of successful software testing and debugging\n• Familiarity with Agile software development methodologies",
        "email": "chm.company.info@clco.online",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Web Developer at CHM Company. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to CHM Company. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Department of Marketing, City University of Hong Kong",
        "job_position": "Research Assistant",
        "job_description": "Job Description:\n• Information acquisition and processing in relation to my research project\n\nJob Requirements:\n• Data collection and analytical skills are required using data analysis software",
        "email": "xuzheng@cityu.edu.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Research Assistant at Department of Marketing, City University of Hong Kong. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Department of Marketing, City University of Hong Kong. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "HairCosys Limtted",
        "job_position": "Software engineer",
        "job_description": "Job Description:\n• Responsible for the research and data development pipeline from data extraction, blending, cleansing, and processing to model creation and result visualization.\n• Research, evaluate and implement different deep-learning algorithms .\n• Monitoring the progress of image recognition and image processing .\n• Research, design, develop, document, test and debug applications software and systems that contain logical and mathe matical solutions.\n• Collaborate with cross-functional teams to deploy machine learning algorithms for testing and production systems.\n\nJob Requirements:\n• Major in Computer Science, Data Science, Mathematics or a related discipline\n• At least one year of experience with machine learning, deep learning, or artificial intelligence\n• Solid experience in Python, and Machine Learning libraries: Tensorflow/ PyTorch\n• Knowledge of Java is highly preferred\n• Able to work in a fast-paced, highly collaborative environment\n• Team Player with good communication skills in English\n• Self-Organized, good problem-solving skills and willing to learn",
        "email": "mail@haircosys.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Software engineer at HairCosys Limtted. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to HairCosys Limtted. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Karrie Industrial Co., Ltd.",
        "job_position": "IT Summer Trainee",
        "job_description": "Job Description\n• 熟悉各类入职系统操作。(eHR，接入公司内网等 )\n• SAP 系统初识，了解  SAP 发展历史和应用于工业的核心作用知悉  SAP 各板块作用以及大致运作流程。\n• 学习有关组织架构，物料主数据，供货商三个板块于  SPRO对应的的配置事务代码 (T-code)。\n• 了解  Karrie 于 SAP 的订货 ,采购，入库，发票校验等流程，并实操练相关的事务。\n• 参与关于订货宝对接  SAP 的会议 ,了解并记录会议相关内容。知悉各部门的协作沟通的方式，并且通过会议内容进一步提升对  SAP 于实际开发业务中的作用和定位。\n\nJob Requirements\n• Excellent communication skills, planning and organization skills.\n• Strong leadership, presentation skills, problem solving skills and opened mind .\n• Strong sense of team work, responsible and proactive character.\n• Proficient  in MS Office applications. (Excel, Access, PowerPoint, etc)",
        "email": "krper@karrie.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the IT Summer Trainee at Karrie Industrial Co., Ltd.. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Karrie Industrial Co., Ltd.. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Lyodssoft Limited",
        "job_position": "AI ENGINEER INTERNSHIP",
        "job_description": "• Assists in technical research and development of a distributed deep learning platform.\n• Assists in researching, developing, designing, and integrating software modules.\n• Assists in model training, tuning, and deployment.\n• Assists in project administrative and ad -hoc tasks assigned by project supervisor.\n\nJob Requirements:\n• Master / Bachelor or equivalent in Computer Science,  Mathematics or a related discipline\n• Analytical and organized person with good interpersonal skills\n• Self-motivated, attentive to details\n• Familiarity with artificial intelligence algorithms such as machine learning, deep learning, neural networks, etc is preferred.\n• Understanding of mainstream open -source framework such as PyTorch, TensorFlow, Paddle, etc is preferred.\n• Proficient in programming algorithms using the Python language is preferred.\n• Knowledge of database (MySQL, MSSQL, Oracle), familia rity with http/https protocols, and frameworks such as Flask is preferred.",
        "email": "info@lyodssoft.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the AI ENGINEER INTERNSHIP at Lyodssoft Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Lyodssoft Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "OXBRIDGE ECONOMICS LIMITED",
        "job_position": "Data Scientist Internship",
        "job_description": "• Work under supervision of professors (research areas: data science, artificial intelligence, applied mathematics), economists, and senior software developers;\n• Contribute to the development of our flagship product (i.e., the intelligent platform for finan cial information retrieval and analysis) through designing and improving search algorithms that are based on a CityU patent;\n• Design and implement parallel computing solutions for large -scale machine learning algorithms;\n• Evaluate and select appropriate cloud computing services to support large -scale machine learning projects;\n• Use economic theory to guide model design, perform statistical hypothesis testing, and create inferences and recommendations based on economic, statistical, and data science model s;\n• Assist in developing interactive dashboards for financial markets and macroeconomy;\n• Build and maintain databases (PostgreSQL); collect structured and unstructured data using various techniques, e.g., web crawling;\n• Write research level publications  or technical white papers with a clear explanation of complicated technical concepts to audiences with diverse business/scientific backgrounds;\n• Communicate with team members and present at internal and external events such as weekly company meetings, re search conferences/seminars.\n\nJob Requirements :\n• Undergraduate/masters/PhD candidates in Data Science, Statistics, Economics, Engineering, or any related STEM fields from Hong Kong universities (final -year students are welcomed as long as you remain a stude nt during your internship);\n• Familarity with natural language processing algorithms (e.g., topic model, TF -IDF, sentiment analysis);\n• Experience with the implementation of machine learning algorithms (e.g., logistic regression, SVM, neural network);\n• Experience with cloud computing platforms such as AWS, Google Cloud, or Azure;\n• Familiarity with distributed computing frameworks such as Spark, Hadoop, and MPI;\n• Strong coding skills with Python, R, and/or Stata;\n• Fluency in English and Chinese (Mandar in or Cantonese) and demonstrated exceptional ability to write structured and clear reports/papers in at least one of \nthe two languages;\n\nPreferred Qualifications :\n• Good understanding of macroeconomics, development economics, and ESG;\n• Proficiency in the use of databases such as Wind, Bloomberg, Capital IQ, etc.;\n• Knowledge of a professional BI tool such as Power BI, Tableau, Qlikview, etc.;\n• Exceptional leadership and management skills.",
        "email": "careers@oxbridge-econ.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Data Scientist Internship at OXBRIDGE ECONOMICS LIMITED. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to OXBRIDGE ECONOMICS LIMITED. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "RevoTech Limited",
        "job_position": "Ontology and AI Developer",
        "job_description": "Work with data scientist to provide consultancy and build knowledge graph and ontology pipeline into web -based application for startups.  \nCreate, test, and deploy well -designed and efficient code.\nExplore new technologies to improve developer experienc e and engineering process.\nProvide consultancy towards clients to navigate differing opinions, ambiguity,  and requirements to build and advocate designs with clear objectives and trade -offs \n\nJob Requirements:\n• Enthusiastic, fast learner\n• Have Python bac kground, with experience in prototyping LLM applications a  priority\n• Strong work ethic, punctual",
        "email": "info@revotechhk.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the Ontology and AI Developer at RevoTech Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to RevoTech Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "Simple Artificial Intelligence Limited",
        "job_position": "SUMMER INTERN ASSISTANT DATA ANALYST",
        "job_description": "• Build and maintain a stable crawler system for applications.  \n• Develop and uphold a stable database update system for crawled data,  encompassing data synchronization, data cleaning, and other related tasks.  \n• Collaborate with cross -functional teams to gather and  analyze data, and  participate in the design and implementation of data service solutions.  \n• Research in organised and systematic approach.  \n• Undertake ad -hoc tasks as assigned from time to time.  \nJob Requirements : \n• Proficiency in Python, Java or Go lang. Solid knowledge in SQL, data structure  and algorithms.  \n• Hands -on experience in the major database systems (e.g. MySQL, MongoDB,  Spark or Hadoop).  \n• Familiar with LLM will be preferred.  \n• Good coding style.  \n• Good verbal and written communication skills in b oth Chinese and English.  ",
        "email": "mingyaliu8@hkaift.com",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the SUMMER INTERN ASSISTANT DATA ANALYST at Simple Artificial Intelligence Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to Simple Artificial Intelligence Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    },
    {
        "company_name": "STEM Hong Kong Limited",
        "job_position": "STEM Engineering Internship",
        "job_description": "**Project Participation**:  \n• Collaborate with the engineering team on various projects, such as product \n design, prototyping, and testing.  \n• Assist in the development and implementation of engineering solutions to \n address client/company needs.  \n• Participate in project meetings, brainstorming sessions, and design reviews.  \n• Contribute to the documentation and reporting of project progress and findings.  \n\n**Technical Skills Development**:  \n• Apply your knowledge of engineering principles, including but not limited to \nmechanical, electrical, software, or civil engineering.  \n• Gain experience in the use of engineering software, tools, and equipment.  \n• Familiarize yourself with industry -standard de sign, analysis, and simulation \ntechniques.  \n• Enhance your problem -solving and critical thinking skills through hands -on \nproblem -solving exercises.   \n\n**Learning and Continuous Improvement**:  \n• Attend training sessions, workshops, and seminars to expand you r technical \nand professional knowledge.  \n• Seek feedback from mentors and supervisors to identify areas for growth and \nimprovement.  \n• Stay up-to-date with the latest trends, technologies, and best practices in the \nSTEM field.  \n• Contribute to the continuous improvement of processes and practices within the \norganization.  \n\n**Job Requirements**:  \n• Problem -solving and Critical Thinking: Exhibit strong problem -solving, \nanalytical, and critical thinking skills to tackle complex engineering \nchallenges.  \n• Communication Skill s: Possess effective written and verbal communication \nskills to collaborate with team members and present technical information to \nstakeholders.  \n• Teamwork and Collaboration: Demonstrate the ability to work effectively in a \nteam environment and contribute to  group projects.  \n• Enthusiasm and Willingness to Learn: Show a genuine interest in the \nengineering field and a willingness to learn new skills and technologies.  \n• Time Management and Organization: Exhibit strong time management and \norganizational skills to mee t deadlines and manage multiple tasks \nsimultaneously.  \n• Safety Awareness: Understand and adhere to safety protocols and regulations \nrelevant to the engineering discipline.  ",
        "email": "peggy@stemhk.com.hk",
        "cover letter": "Dear Hiring Manager,\n\nI am excited to apply for the STEM Engineering Internship at STEM Hong Kong Limited. As a data science student with hands-on experience in AI development, data analytics, and software engineering, I am eager to bring my technical expertise and problem-solving mindset to your team.\n\nMy experience spans across AI-driven projects and data analytics roles. During my internship at Resume Page Limited, I developed an AI-powered profile chatbot using Llama and MySQL, improving user engagement by 35%. I also engineered a business card scanner with face recognition, streamlining information exchange by 30%. My prior data analyst internship at IESHER involved analyzing World Bank data to identify policy insights, reinforcing my ability to extract meaningful narratives from complex datasets.\n\nBeyond technical expertise, I am passionate about building impactful solutions. My recent smart fridge platform, developed for a hackathon, integrates inventory tracking with AI-powered recipe recommendations and shopping list generation—demonstrating my ability to merge AI with real-world applications. My leadership experience in tutoring and mentoring has further sharpened my communication and collaboration skills.\n\nI am eager to contribute my analytical skills and AI-driven mindset to STEM Hong Kong Limited. I would welcome the opportunity to discuss how my experience aligns with your team’s goals. Thank you for your time, and I look forward to your response.\n\nBest regards,\nChristopher Otniel Eleazar"
    }
]